[
    {
        "job_link": "https://www.linkedin.com/jobs/view/junior-node-js-developer-at-team-remotely-inc-3963813533?position=15&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=dxkkYoSTGEIabfk2zy08Wg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Junior Node.JS Developer",
        "company_name": "Team Remotely Inc",
        "job_location": "Sioux Falls, SD",
        "job_posted": "20 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong><strong>Junior Node.JS Developer</strong> (1 year experience, onsite)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong> Hiring Type:</strong> Full-Time<br><br><strong> Base Salary:</strong> $57K-$67K Per Annum.<br><br>Description:<br><br>In this role, you will work closely with experienced developers and contribute to the design, development, and maintenance of robust and scalable applications using Node.js. This is an excellent opportunity for someone looking to kick-start their career in web development.<br><br>Responsibilities:<br><br><ul><li>Collaborate with the development team to gather project requirements and specifications. </li><li>Assist in the design, development, and maintenance of server-side applications using Node.js. </li><li>Learn to develop and consume RESTful APIs, integrating with third-party services. </li><li>Write clean and efficient code following best practices and coding standards. </li><li>Participate in unit testing and debugging to ensure code quality and reliability. </li><li>Collaborate with front-end developers to integrate server-side logic with client-side components. </li><li>Contribute to code reviews and actively participate in knowledge sharing. </li><li>Stay updated with emerging technologies and industry trends to enhance your skills and knowledge. </li><li>Seek guidance and support from senior team members to resolve technical issues. <br><br></li></ul><strong>Qualifications<br><br></strong><ul><li>Bachelor's degree in Computer Science, Software Engineering, or a related field. </li><li>Basic understanding of JavaScript and web technologies. </li><li>Familiarity with Node.js and its ecosystem. </li><li>Understanding of asynchronous programming and event-driven architecture. </li><li>Knowledge of databases and SQL. </li><li>Strong problem-solving and analytical skills. </li><li>Excellent communication and collaboration abilities. </li><li>Eagerness to learn and a passion for web development. </li><li>Ability to work both independently and in a team-oriented, collaborative environment. <br><br></li></ul>Benefits:<br><br><ul><li>Competitive salary based on skills, qualifications, and experience. </li><li>Comprehensive health, dental, and vision insurance plans. </li><li>Paid time off and holidays. </li><li>Flexible work schedule and remote work options. </li><li>Mentorship and guidance from experienced developers. </li><li>Learning and growth opportunities to enhance your skills and knowledge in web development. </li><li>Access to resources and training programs to stay updated with emerging technologies and industry trends.</li></ul>\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "information technology",
        "industries": "software development"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/software-developer-at-ricefw-technologies-inc-3961111940?position=18&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=Jq8V7K2Q7K9BhR87chPW4A%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Software Developer",
        "company_name": "RICEFW Technologies Inc",
        "job_location": "Charlottesville, VA",
        "job_posted": "8 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Please Note: As of July 22, 2021, our team will require that all candidate submissions include a LinkedIn profile. Please do not submit any candidates that do not have a LinkedIn.<br><br></strong><ul><li>Mid-Level </li><li>3 to 7 years of experience </li><li>Needs to have experience working in Agile environment. </li><li>Fluid in .NET core (6 and up) with C#, Front end with jQuery, HTML, and Bootstrap, ASP.NET Web API, Windows Services, Entity Framework, Deep knowledge of OOP is necessary for this role. <br><br></li></ul>Rank :A2<br><br>Requested Date :2024-06-25\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/ricefw?trk=public_jobs_topcard-org-name",
        "seniority_level": "mid-senior level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "information technology & services"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/software-development-engineer-at-adobe-3929732300?position=13&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=AXAlbqvVANPgsCvi02p6OQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Software Development Engineer",
        "company_name": "Adobe",
        "job_location": "San Jose, CA",
        "job_posted": "18 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Our Company<br><br></strong>Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.<br><br>We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!<br><br>Adobe Experience Platform is the Adobe solution that helps customers to centralize and standardize their customer data and content across the enterprise powering 360-degree customer profiles, enabling data science and data governance to drive real-time personalized experiences. With Adobe Experience Platform, our enterprise customers are able to manage their data lifecycle. From ingestion to processing, analysis, attribution and activation, Adobe Experience Platform helps customer gain insight and use those insights in real time.<br><br>We are looking for an experienced and curious engineer to be part of a core component team. As a software development engineer, we expect the candidate to contribute to one of the heavily used and technically sound feature of Adobe Experience Platform.<br><br>Tasks here can range from software design and reviews to developing highly efficient enterprise software. Work closely with senior developers and architects and is able to produce good quality code. Since most of the work would involve either processing big data or managing sophisticated data pipelines, a candidate who can develop end to end view of a system or is willing to learn will be preferred.<br><br><strong>What You'll Do<br><br></strong><ul><li>Design, implement, and own critical features in a micro-service architecture. </li><li>Coordinate with architects, senior developers and other integrating teams. </li><li>Subscribe to developments happening within Adobe ecosystem. </li><li>Ensure quality of component meets high standards and ensure all appropriate validations are in place and being monitored. </li><li>Work closely with product managers, asks questions and contribute to software architecture. </li><li>Keep on look out for upcoming technologies and cost saving initiatives without compromising the product requirements and quality. </li><li>Open to learning and experimenting with upcoming technologies in a fast paced environment. </li><li>Act with clarity and precision, ensuring projects are driven with a strong sense of ownership and direction. <br><br></li></ul><strong>What you'll need to succeed <br><br></strong><ul><li>Bachelors' degree in Computer Science or equivalent. </li><li>Prior experience working on large scale distributed systems or data processing systems. </li><li>Proficiency in Java and/or Scala. </li><li>Expertise in SQL DB, No-SQL DB, Web Services, Data Intensive applications, Big Data Processing pipelines. </li><li>Exposure to Apache Spark, Apache Hadoop, Apache Kafka, AWS Services, Azure Services, Microservice Architecture, Databricks. </li><li>Always striving to implement coding best practices and scalable design. </li><li>Ability to model solutions for distributed processing problems. <br><br></li></ul><strong>What Will Help You Stand Out From The Crowd<br><br></strong><ul><li>Experience developing backend distributed applications on Java/JVM and Spring (or similar framework). </li><li>Shown experience using structured, focused approaches to solving technical, data, and logical problems. <br><br></li></ul>Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $137,100.00 - $218,900.00 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.<br><br>At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).<br><br>In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.<br><br><strong>Internal Opportunities<br><br></strong>Creativity, curiosity, and constant learning are celebrated aspects of your career growth journey. We’re glad that you’re pursuing a new opportunity at Adobe!<br><br><strong>Put your best foot forward:<br><br></strong><ul><li> Update your Resume/CV and Workday profile – don’t forget to include your uniquely ‘Adobe’ experiences and volunteer work. </li><li> Visit the Internal Mobility page on Inside Adobe to learn more about the process and set up a job alert for roles you’re interested in. </li><li> Check out these tips to help you prep for interviews. </li><li> If you are applying for a role outside of your current country, ensure you review the International Resources for Relocating Employees on Inside Adobe, including the impacts to your Benefits, AIP, Equity &amp; Payroll . <br><br></li></ul>Once you apply for a role via Workday, the Talent Team will reach out to you within 2 weeks. If you move into the official interview process with the hiring team, make sure you inform your manager so they can champion your career growth.<br><br>At Adobe, you will be immersed in an exceptional work environment that is recognized around the world. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely. If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.<br><br><em> Adobe is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless ofgender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law. <br><br></em><em> If you have a disability or special need that requires accommodation to navigate our internal careers site or to complete the application process, please contact </em> accommodations@adobe.com .<br><br>Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $108,000 -- $198,500 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.<br><br>At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).<br><br>In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.<br><br>Adobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.<br><br>Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.<br><br>Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/adobe?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "it services and it consulting, advertising services, and software development"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/software-developer-at-naval-air-systems-command-navair-3960898416?position=14&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=%2BaAg%2BPI9CkAlW%2BH0xQ4pIQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Software Developer",
        "company_name": "Naval Air Systems Command (NAVAIR)",
        "job_location": "China Lake, CA",
        "job_posted": "9 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Position Description<br><br></strong>WSMP Developers are responsible for making modifications and enhancements to various WSMP desktop software applications or micro services. Specific responsibilities of the Developer are outlined below.<br><br><ul><li>Follow established WSMP Agile policies, processes, and other defined guidelines for software development, maintenance and product deliveries. </li><li>Perform system software development, enhancement, and maintenance functions throughout a product’s life cycle. </li><li>During the software development cycle, maintain responsibility for requirements, use cases, design documentation, code, unit testing, user documentation, developer documentation </li><li>Provide level of effort estimates during or before sprint meetings, including rationales when required. </li><li>Review and analyze specifications, ICDs, and other engineering documentation to determine engineering requirements. </li><li>Participate in development of milestones and schedules, and determine appropriate software development criteria. </li><li>Analyze identified Fleet anomalies and provide corrections. </li><li>Complete assigned software changes in an accurate, robust, well documented and tested manner in accordance with a documented schedule. </li><li>Organize or participate in change reviews. Typical review items include system and software requirements, design, code, traceability matrices, test plans, test cases and user documentation. </li><li>Appraise the Team Lead or Product Lead of any problems impacting technical products or schedule as soon as they are identified. </li><li>Perform software unit testing to verify that software requirements are being satisfied at the unit level (prior to full system integration). Assist test team with Integration testing as needed. </li><li>Attend and productively contribute to sprints, scrums, and retrospectives. </li><li>Develop and maintain the skills required to be successful within the software engineering and test environments, including any training needs. </li><li>Provide suggestions to modify and improve WSMP processes and tools. <br><br></li></ul><strong>Minimum Salary<br><br></strong>91,254<br><br><strong>Maximum Salary<br><br></strong>141,064\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/naval-air-systems-command?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "defense and space manufacturing"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/entry-junior-level-software-developer-remote-at-synergisticit-3964100670?position=16&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=bCdTkytEBLI5YKhFmlJImw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Entry/Junior Level Software Developer - Remote",
        "company_name": "SynergisticIT",
        "job_location": "Las Vegas, NV",
        "job_posted": "10 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          For more than 12 years Synergisticit has helped Jobseekers stand out from other Jobseekers by providing candidates the requisite skills, experience and technical competence to outperform at interviews and at clients. Here at SynergisticIT We just don't focus on getting you a tech Job we make careers.<br><br>In this market also our candidates get multiple job offers and $100k + salaries.<br><br>please check the below links to see success outcomes of our candidates .<br><br>(url removed)<br><br>We regularly interact with the Top Tech companies to give our candidates a competitive advantage-Please see us exhibiting at Oracle Cloud world /Oracle Java one (Las vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023<br><br>All Positions are open for all visas and US citizens<br><br>We at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart labs etc to name a few.<br><br>Currently, We are looking for entry-level software programmers, Java Full stack developers, Python/Java developers, Data analysts/ Data Scientists, Machine Learning engineers for full time positions with clients.<br><br>Who Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and looking to make their careers in the Tech Industry.<br><br>We assist in filing for STEM extension and also for H1b and Green card filing to Candidates<br><br>We want Data Science/Machine learning/Data Analyst and Java Full stack candidates<br><br>For data Science/Machine learning Positions<br><br><strong>Required Skills<br><br></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br><br>Project work on the technologies needed<br><br>Highly motivated, self-learner, and technically inquisitive<br><br>Experience in programming language Java and understanding of the software development life cycle<br><br>Knowledge of Statistics, SAS, Python, Computer Vision, data visualization tools<br><br>Excellent written and verbal communication skills<br><br>Preferred skills: NLP, Text mining, Tableau, PowerBI, Databricks, Tensorflow<br><br><strong>REQUIRED SKILLS For Java /Full Stack/Software Positions<br><br></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br><br>Highly motivated, self-learner, and technically inquisitive<br><br>Experience in programming language Java and understanding of the software development life cycle<br><br>Project work on the skills<br><br>Knowledge of Core Java , javascript , C++ or software programming<br><br>Spring boot, Microservices, Docker, Jenkins and REST API's experience<br><br>Excellent written and verbal communication skills<br><br>If you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team who only connect with candidates who are matching client requirements.<br><br>No phone calls please. Shortlisted candidates would be reached out. No third party or agency candidates or c2c candidates\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "it services and it consulting"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/software-engineer-l5-ads-platform-engineering-at-netflix-3669206397?position=1&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=K5HaDMleu56hxDImiKbUFA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Software Engineer (L5) - Ads Platform Engineering",
        "company_name": "Netflix",
        "job_location": "United States",
        "job_posted": "18 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          At Netflix, we want to entertain the world and are constantly innovating how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 233 million paid subscribers.<br><br>We launched a new ad-supported tier in November 2022 to offer our members more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply engaged.<br><br><strong>Our Team<br><br></strong>The Ads Platform Engineering teams build advertising systems and integrations that power the delivery of ads using our world-class content delivery ecosystem. We use a number of Netflix investments and innovations to power our ads - a unique mix of client and server-side ad insertions, state-of-the-art content delivery systems, ad encoding recipes, content understanding and metadata, etc. We deliver ads in a manner that’s thoughtful of our member’s viewing experience and drive great outcomes for advertisers. We also ensure that advertiser brand safety is ensured during serving, members only see the most appropriate ads for them.<br><br>Our team is new and yet faced with the enormous ambitions of building highly performant advertising systems and delivering high impact to our business by monetizing our incredible slate of content. As one of the newest entrants in the Connected TV advertising space that’s rapidly growing, we seek to build unique value propositions that help us differentiate from the competition and become a market leader in record time.<br><br>We are looking for highly motivated engineers working in the advertising space who are excited to join us on this journey.<br><br><br><strong>Skills &amp; Experience We’re Seeking<br><br><br></strong><ul><li>Well-grounded domain experience in ANY ONE of these 4 areas :</li><li> 1- (Ad Delivery) Building publisher-side ad tech systems such as ad servers, bidders and pacers, yield optimizers, or their demand-side counterparts (DSPs).</li><li> 2 - (Identity and Audience Targeting) Built identity graphs, integrated with DMPs, and worked on enabling audience targeting, 1P or 3P segments</li><li> 3 - (Measurement) Familiarity with brand lift measurement, incrementality-based measurement, outcomes measurement, etc.</li><li> 4 - (Sales Enablement) Guaranteed and non-guaranteed inventory reservations and management, Sales tooling, Integrations with OMS, CRM systems, etc.</li><li>General understanding of the advertising marketplace and landscape</li><li>Worked closely with ad operations to enable campaign setup, targeting, reporting, and advertiser needs</li><li>Developed many cloud-based applications and comfortable with modern programming languages (preferably object-oriented),</li><li>Familiar with A/B testing and experimentation.<br><br><br><br></li></ul><strong>Nice To Haves<br><br><br></strong><ul><li>Contributed to an ads industry technology standard (e.g VAST, OpenRTB) or worked on an industry consortium effort, working group etc.</li><li>Familiarity with legal compliance and changing landscape of ads regulations around the world.</li><li>Experience working in the CTV space and knowledge of it’s unique constraints<br><br><br></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.<br><br>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.<br><br>Netflix is a unique culture and environment. Learn more here.<br><br>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/netflix?trk=public_jobs_topcard-org-name",
        "seniority_level": "not applicable",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "movies, videos, and sound, technology, information and internet, and entertainment providers"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/junior-frontend-engineer-javascript-html-css-at-hiremefast-llc-3963816311?position=17&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=qzx2fOJtr8ZULkLzr0xPMA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Junior Frontend Engineer (JavaScript/HTML/CSS)",
        "company_name": "HireMeFast LLC",
        "job_location": "Alamogordo, NM",
        "job_posted": "20 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong> DISCLAIMER: </strong> This job posting is intended for active pooling of candidates who will become part of our talent pool. Your qualifications will be assessed against both current and future job openings. Should your application align with a role that corresponds to your skills and experience, and an opportunity arises, our recruitment team will reach out to you immediately. Please note that this does not guarantee immediate placement or contact. Additionally, we exclusively consider applications from individuals who are currently reside in the US/Canada during their application process.<br><br><strong> Salary:</strong> $62,000 - $72,000 per annum<br><br><strong> Experience Required: </strong> Minimum 1 year of project experience<br><br><strong>Roles &amp; Responsibilities<br><br>Web Frontend Developer, will collaborate with the team to develop and enhance the front-end of our web framework, ensuring the delivery of intuitive and visually appealing user interfaces.<br><br>They will work closely with designers, leveraging your expertise in HTML/CSS, JavaScript, React, Next.js, and UI/UX design to create clean and responsive web layouts.<br><br><strong>Responsibilities<br><br></strong>Collaborate with the project team to develop and enhance the front-end of our web framework.<br><br>Implement intuitive and visually appealing user interfaces based on UI/UX designs.<br><br>Create clean and responsive web layouts using HTML/CSS.<br><br>Utilize JavaScript frameworks, libraries, and best practices to enhance frontend functionality.<br><br>Ensure compatibility across multiple browsers and devices.<br><br>Collaborate with designers to bring their creative vision to life.<br><br>Familiarity with Git for collaborative development and version control.<br><br>Work with AWS EC2 and Lambda for cloud-based development.<br><br><strong>Requirements<br><br></strong>Bachelors degree in computer science, Software Engineering, or a related field (or equivalent experience).<br><br>2+ years of proven experience as a Web Frontend Developer or similar role.<br><br>Proficiency in HTML/CSS and creating clean and responsive web layouts.<br><br>Strong knowledge of JavaScript frameworks, libraries, and best practices.<br><br>Experience with React and Next.js frontend frameworks.<br><br>Ability to collaborate effectively with designers to implement UI/UX designs.<br><br>Familiarity with Git for collaborative development and version control.<br><br>Experience working with AWS EC2, and Lambda is a plus.<br><br>Strong problem-solving skills and attention to detail.<br><br>Excellent communication and teamwork abilities.<br><br>A passion for delivering high-quality, user-centered web experiences.<br><br>Experience with Adobe Target is a nice to have.<br><br></strong>\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/hiremefast-llc-us?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "information technology",
        "industries": "software development"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/junior-java-developer-at-team-remotely-inc-3963816319?position=11&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=xziB4MtLxKAjMZQdbLhKoQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Junior Java developer",
        "company_name": "Team Remotely Inc",
        "job_location": "Providence, RI",
        "job_posted": "20 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong> <strong>Junior Java developer</strong> (1 year experience, remote)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong> Hiring Type:</strong> Full-Time<br><br><strong> Base Salary:</strong> $59K-$69K Per Annum.<br><br><strong>Description<br><br></strong>An entry-level Java developer with Java development experience or similar academic background.<br><br>The key skills are<br><br><ul><li>Java, J2EE, Fullstack Development, Spring, MVC, Hibernate, and Web Apps development. </li><li>HTML, CSS, JavaScript, Angular, React, and Node Etc. </li><li>Knowledge of relational databases (e.g. SQL Server, Oracle) </li><li>Experience working on Cloud Technologies and Environments (i.e. AWS, Azure, Google Cloud) </li><li>Good knowledge of Object object-oriented design and development. </li><li>Impeccable software engineering habits (e.g. unit and regression testing, code reviews, etc.) </li><li>Knowledge of developing complex, high-performance enterprise software. </li><li>BE/BTech or MS in CS, CE, SE, ECE - recent Graduate is required. </li><li>Good written and verbal communication skills. </li><li>A positive outlook, an interest in adapting to new technologies, a passion for software engineering, and the ability to work as part of a team.</li></ul>\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
        "employment_type": "full-time",
        "job_function": "information technology",
        "industries": "software development"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/junior-backend-engineer-at-team-remotely-inc-3963815290?position=12&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=xI2Bs7dgIgMe7kU0VgFpRQ%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Junior Backend Engineer",
        "company_name": "Team Remotely Inc",
        "job_location": "Sioux Falls, SD",
        "job_posted": "20 hours ago",
        "exact_date": "2024-06-30",
        "description": [],
        "company_link": null
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/%E2%80%8Bjunior-web-developer-at-team-remotely-inc-3963817319?position=10&pageNum=0&refId=egi8j5G%2FjNpPIQnm9phmfw%3D%3D&trackingId=LT%2F3teM2LtXaG%2BVVg0CTJA%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Junior Web Developer",
        "company_name": "Team Remotely Inc",
        "job_location": "Philadelphia, PA",
        "job_posted": "20 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong> <strong>Junior Web Developer</strong> (1 year experience, remote)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong> Hiring Type:</strong> Full-Time<br><br><strong> Base Salary:</strong> $58K-$68K Per Annum.<br><br>Description:<br><br>You will work closely with our senior developers to design, develop, and maintain high-quality websites and web applications. This is an excellent opportunity to gain hands-on experience in a collaborative environment and contribute to exciting projects.<br><br>Responsibilities:<br><br><ul><li>Collaborate with the development team to understand project requirements and design web solutions </li><li>Write clean, efficient, and well-structured code using HTML, CSS, and JavaScript </li><li>Assist in the development and implementation of responsive and user-friendly web interfaces </li><li>Integrate front-end designs with back-end functionality using appropriate technologies </li><li>Conduct thorough testing and debugging to ensure seamless functionality </li><li>Assist in website maintenance, updates, and enhancements </li><li>Stay up-to-date with industry trends and emerging web development technologies </li><li>Collaborate with cross-functional teams to deliver projects on time and within scope </li><li>Document technical specifications, project details, and development processes <br><br></li></ul>Qualifications:<br><br><ul><li>Bachelor's degree in Computer Science, Web Development, or a related field </li><li>Solid understanding of web development principles and best practices </li><li>Proficiency in HTML, CSS, and JavaScript </li><li>Familiarity with front-end frameworks such as Bootstrap or Foundation </li><li>Basic understanding of back-end development technologies (e.g., PHP, Python, or Ruby) </li><li>Knowledge of version control systems (e.g., Git) </li><li>Experience with responsive web design and mobile-first development </li><li>Strong problem-solving and analytical skills </li><li>Excellent communication and teamwork abilities </li><li>Self-motivated with a strong desire to learn and grow as a developer <br><br></li></ul>Preferred Qualifications:<br><br><ul><li>Previous experience with web development projects (personal or professional) </li><li>Knowledge of JavaScript frameworks/libraries (e.g., React, Angular, or Vue.js) </li><li>Familiarity with content management systems (e.g., WordPress, Drupal, or Joomla) </li><li>Understanding of SEO principles and best practices </li><li>Experience with web accessibility standards and guidelines </li><li>Knowledge of web security best practices</li></ul>\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "information technology",
        "industries": "software development"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/senior-fullstack-engineer-infura-at-consensys-3946156342?position=10&pageNum=55&refId=4c%2FcHuFrPPUQ9b0mQDH31g%3D%3D&trackingId=lCb%2BnliDkyu3bxFfKHSmvw%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Senior Fullstack Engineer - Infura",
        "company_name": "Consensys",
        "job_location": "United States",
        "job_posted": "16 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on.<br><br>Working with Consensys puts you at the <strong>forefront of an evolving paradigm</strong>, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society.<br><br>Blockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users.<br><br>You’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the <strong>top of your game</strong>. You’ll join a network of entrepreneurs and technologists that reaches the <strong>edge of our ecosystem</strong>. Consensys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.<br><br><strong>About Infura<br><br></strong>Infura is the leading infrastructure platform providing scalable and easy-to-use APIs and cloud solutions for blockchain and decentralized application developers. Infura currently offers APIs for Ethereum, IPFS, and other leading decentralized networks, allowing developers to immediately begin building instead of spending time on architecting and maintaining their own infrastructure.<br><br>Infura provides developers instant access to decentralized and blockchain networks without the need to sync or understand complicated peer to peer infrastructure. Similar to how one might access a cloud service to alleviate the friction of owning proprietary compute and storage, Infura lowers the barrier to entry for engineers to begin building.<br><br>We believe in a more equitable and decentralized future, and we know developers will be at the forefront of that progress. We want to empower developers to spend their time building, creating, and evolving by providing them with the best and easiest solution to their infrastructure needs.<br><br>Some things to know about the Infura team, we are a remote first company, with team members all over the world. We strive to reduce meetings, respect work life balance, promote diversity, and generally be good people. We depend on each other not only to make an amazing product but to be a group that wants to succeed together.<br><br><strong>What You’ll Do<br><br></strong>Our Fullstack Engineers are self-starters, creative thinkers and have a true conviction to push the edge of innovation in technology. Managing development tasks from assignment through to production, you will work with large code bases while minimizing technical debt, have a strong knowledge of modern Javascript, and care about crafting elegant, well-tested code.<br><br><strong>Would be great if you brought this to the role<br><br></strong><ul><li>5+ years of fullstack engineering experience</li><li>Solid understanding of modern Javascript/Typescript</li><li>Proficiency with React, Next.js, Node.js &amp; Vercel</li><li>Experience with Redis &amp; PostgreSQL </li><li>Knowledge of building and optimizing CI/CD workflows</li><li>Advocate of writing well-tested, scalable and performant code </li><li>Ownership of engineering best practices and operational excellence</li><li>Awareness of monitoring &amp; observability best practices</li><li>Experience collaborating with QA and product teams</li><li>A belief in our mission and values<br><br></li></ul><strong>Bonus points:<br><br></strong><ul><li>Experience with microservices architecture</li><li>Experience with gRPC framework </li><li>Experience and/or interest in cryptography</li><li>An understanding of the Blockchain and Ethereum ecosystem, with an interest and curiosity to learn more</li><li>You’re a MetaMask/Infura user!<br><br></li></ul>Don't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.<br><br><em>Consensys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. Consensys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/)</em><em>.<br><br></em><em>The salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills.<br><br></em>US pay range (not including bonus, equity or other benefits)<br><br>$118,000—$209,000 USD<br><br>\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/consensys-software-inc?trk=public_jobs_topcard-org-name",
        "seniority_level": "mid-senior level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "software development"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/systems-engineer-at-ricefw-technologies-inc-3961112865?position=4&pageNum=30&refId=h881QaXt183x1SiGHCXJeQ%3D%3D&trackingId=TAeKSeCYD1viToKEQRtbwg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Systems Engineer",
        "company_name": "RICEFW Technologies Inc",
        "job_location": "Boston, MA",
        "job_posted": "8 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Please Note: As of July 22, 2021, our team will require that all candidate submissions include a LinkedIn profile. Please do not submit any candidates that do not have a LinkedIn.<br><br></strong>Rank :A3<br><br>Requested Date :2024-06-25\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/ricefw?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "information technology",
        "industries": "information technology & services"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/software-engineer-beam-planning-starlink-at-spacex-3928919892?position=5&pageNum=67&refId=N083EenEAIrVYw2%2Bo%2FkCdA%3D%3D&trackingId=b0R8cuv1MGK7qMfdGyfZ7A%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Software Engineer, Beam Planning (Starlink)",
        "company_name": "SpaceX",
        "job_location": "Redmond, WA",
        "job_posted": "13 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.<br><br><strong>SOFTWARE ENGINEER, BEAM PLANNING (STARLINK)<br><br></strong>At SpaceX we’re leveraging our experience in building rockets and spacecraft to deploy Starlink, the world’s most advanced broadband internet system. Starlink is the world’s largest satellite constellation and is providing fast, reliable internet to 3M+ users worldwide. We design, build, test, and operate all parts of the system – thousands of satellites, consumer receivers that allow users to connect within minutes of unboxing, and the software that brings it all together. We’ve only begun to scratch the surface of Starlink’s potential global impact and are looking for the world’s best engineers to help maximize Starlink’s utility for communities and businesses around the globe.<br><br>As a Beam Planning Software Engineer on the Starlink program, you will be solving challenges that improve our ability to fully utilize the hardware we have deployed. Our goal is to provide customers with the best possible satellite internet experience, often providing under-served communities with affordable, life-changing broadband internet access.<br><br>Our software engineers are responsible for the complete lifecycle of the software they create, including development, testing, and support. We expect our engineers to close the feedback loop between software design and real-world performance. In this role, your software will have a meaningful and measurable impact on the world.<br><br><strong>Responsibilities<br><br></strong><ul><li>Develop highly reliable, real-time software that plans and executes network topology for our low-latency, high-bandwidth satellite-based global network in order to connect assets and maximize user experience.</li><li>Participate in and lead architecture, design, and code reviews.</li><li>Develop prototypes and manage experiments to prove out key design concepts.</li><li>Develop tools for software development and deployment, data analysis and visualization, and test execution across multiple environments, including virtualized hardware environments, real hardware-in-the-loop simulations, and on-orbit testing.<br><br></li></ul><strong>Basic Qualifications<br><br></strong><ul><li>Bachelor’s degree in computer science, engineering, math, or science discipline; OR 2+ years of professional experience in software development in lieu of a degree (internship experience is applicable).</li><li>Development experience in assembly, C, or C++.<br><br></li></ul><strong>Preferred Skills And Experience<br><br></strong><ul><li>Knowledgeable in real-time rendering, game engine development, physics simulation, or other real-time, resource-constrained, high-performance computing.</li><li>Knowledgeable in network topology, numerical optimization techniques, graph theoretic approaches, or convex optimization.</li><li>Developed, debugged, and deployed software that has been used in real world applications/projects.</li><li>Creative approach to problem solving, exceptional analytical skills, and engineering fundamentals.</li><li>Excellent communication skills both written and verbal.</li><li>Ability to work effectively in a dynamic environment with changing needs and requirements.</li><li>Experience with distributed systems and internet services.<br><br></li></ul><strong>Additional Requirements<br><br></strong><ul><li>Must be willing to work extended hours and weekends as needed.<br><br></li></ul><strong>Pay Range<br><br></strong><strong>COMPENSATION AND BENEFITS: <br><br></strong>Software Engineer/Level I: $120,000.00 - $145,000.00/per year<br><br>Software Engineer/Level II: $140,000.00 - $170,000.00/per year<br><br>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br><br>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k)-retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.<br><br><strong>Itar Requirements<br><br></strong><ul><li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C.</li><li>1157, or (iv) Asylee under 8 U.S.C.</li><li>1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here. <br><br></li></ul>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.<br><br>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/spacex?trk=public_jobs_topcard-org-name",
        "seniority_level": "entry level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "aviation and aerospace component manufacturing"
    },
    {
        "job_link": "https://www.linkedin.com/jobs/view/azure-senior-software-engineer-at-scaleneworks-inc-3960891292?position=1&pageNum=57&refId=WL6luDZQCDw%2BEN7maE9TqQ%3D%3D&trackingId=R3jJsull%2BRXxNFct0LQUMg%3D%3D&trk=public_jobs_jserp-result_search-card",
        "job_title": "Azure Senior Software Engineer",
        "company_name": "ScaleneWorks INC",
        "job_location": "Dallas, TX",
        "job_posted": "12 hours ago",
        "exact_date": "2024-06-30",
        "description": [
            "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Experienced Software Engineer Profile<br><br><strong>Experience Overview<br><br></strong><ul><li> More than 8 years of progressive experience in software engineering.</li><li> Skilled in serving as a senior engineer throughout the software development lifecycle.</li><li> Proficient in technologies such as C#, .NET Core, MVC, SQL Server, ASP.NET, Web Services, Web API, .NET Services, and Restful APIs.</li><li> Familiarity with Azure Web Services, Azure functions and durable functions, Azure Service Bus, Azure Monitoring, and other Azure capabilities.</li><li> Proficient in database schema design, stored procedures, and SQL scripts using SQL Server and T-SQL.</li><li> Experience with CosmosDB or other document databases.</li><li> Skilled in source code control systems, merging, versioning, and release and deployment activities, with a preference for GitHub.<br><br></li></ul><strong>Skills And Abilities<br><br></strong><ul><li> Strong knowledge of software programming practices and procedures.</li><li> Ability to independently define problems, collect data, and draw valid conclusions logically.</li><li> Proficient in designing program logic, preparing test data, and testing programs.</li><li> Willingness to work flexible hours, including evenings, weekends, and holidays as necessary.</li><li> Understanding of the importance of maintaining a sense of urgency with a high level of quality.</li><li> Capable of establishing testing service level agreements (SLA) with technical partners.</li><li> Proficiency in functional and performance testing aspects of software development.<br><br></li></ul><strong>Technical Expertise<br><br></strong><ul><li> Azure Cloud PaaS.</li><li> RDBMS and SQL, including the development and tuning of scripts, functions, and stored procedures.</li><li> No-SQL databases.</li><li> Knowledge of the SAFe Agile Framework.</li><li> Familiarity with secured coding best practices, with a preference for Veracode.</li><li> Background in healthcare industry.<br><br></li></ul>Employment Type: Full-Time\n        </div>"
        ],
        "company_link": "https://www.linkedin.com/company/scalene-works-inc?trk=public_jobs_topcard-org-name",
        "seniority_level": "mid-senior level",
        "employment_type": "full-time",
        "job_function": "engineering and information technology",
        "industries": "staffing and recruiting"
    }
]