[
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-remote-at-gyga-force-3978919684?position=26&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=xxSc2%2F1lTY804qU258Q3dA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer (Remote)", "company_name": "Gyga Force", "job_location": "United States", "job_posted": "4 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Our client is an innovative consumer electronics company with headquarters in Boston, MA. They are currently looking a <strong>fully remote</strong> software developer as follow.</p><p><br></p><p><strong><u>Responsibilities:</u></strong></p><p><br></p><ul><li>Develop, test, and maintain web applications using JavaScript, HTML, and CSS.</li><li>Collaborate with cross-functional teams to define, design, and ship new features.</li><li>Optimize applications for maximum speed and scalability.</li><li>Troubleshoot and debug issues, ensuring high-quality standards in the codebase.</li><li>Stay up-to-date with emerging technologies and industry trends to continuously improve skills and productivity.</li><li>Write clean, maintainable, and efficient code following best practices.</li><li>Participate in code reviews to maintain code quality and share knowledge.</li><li>Assist in the design and development of user interfaces and user experiences.</li></ul><p><br></p><p><strong><u>Qualifications:</u></strong></p><p><br></p><ul><li>Bachelor’s degree or higher in Computer Science, Engineering, or a related field.</li><li>3+ years’ experience with JavaScript, HTML, and CSS.</li><li>Strong understanding of web development principles and responsive design.</li><li>Experience with front-end frameworks such as React, Angular, or Vue.js.</li><li>Familiarity with version control systems, particularly Git.</li><li>Knowledge of RESTful APIs and how to interact with them.</li><li>Excellent problem-solving skills and attention to detail.</li><li>Strong communication skills and the ability to work well in a team environment.</li></ul><p><br></p><p><strong><u>Nice to Have:</u></strong></p><p><br></p><ul><li>Experience with TypeScript.</li><li>Knowledge of back-end technologies such as Node.js, Express, or Django.</li><li>Familiarity with databases, both SQL (e.g., MySQL, PostgreSQL) and NoSQL (e.g., MongoDB).</li><li>Understanding of DevOps practices and tools such as Docker, Jenkins, or Kubernetes.</li><li>Experience with cloud platforms like AWS, Azure, or Google Cloud.</li><li>Knowledge of testing frameworks and tools like Jest, Mocha, or Selenium.</li><li>Understanding of Agile methodologies and practices.</li></ul><p><br></p><p><strong><u>Perks:</u></strong></p><p><br></p><ul><li>Work remotely.</li><li>Competitive salary.</li><li>Annul Bonus</li><li>Restricted stock units (RSU's).</li><li>Comprehensive health, dental, and vision insurance.</li></ul><p><br></p><p>For a list of all Gyga Force openings, please visit www.gygaforce.com.</p><p></p>\n        </div>"], "company_link": "https://www.linkedin.com/company/gyga-force?trk=public_jobs_topcard-org-name", "seniority_level": "mid-senior level", "employment_type": "full-time", "job_function": "engineering", "industries": "it services and it consulting"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-at-microsoft-3980471564?position=25&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=%2BOB4%2F3C8ETU7sgscRX6W5g%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer", "company_name": "Microsoft", "job_location": "Redmond, WA", "job_posted": "20 hours ago", "exact_date": "2024-07-19", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Microsoft Dynamics 365 is a suite of easy-to-learn and easy-to-use business solutions tailored to any market, designed for any business size, and dedicated to growing business through happy customers. The Customer Service Applications Team delivers business applications for Connected Customer Care for Contact Centers! We are building the next generation of our applications running on Azure that pull together Dynamics 365, Office 365 and a number of other Microsoft cloud services to deliver high value, complete, and predictive application scenarios across all devices and form factors.<br><br>As a <strong>Principal Software Engineer</strong> in the Microsoft Dynamics Customer Service Applications team, you will work with senior business and technology leaders as well as internal business users and Partners to conceive, design and implement Dynamics 365 applications and pick the best technical architecture to solve their business needs.<br><br>We innovate and collaborate closely with our partners and customers in a very agile environment. If the opportunity to collaborate with a diverse engineering team, on enabling end-to-end business scenarios using cutting-edge technologies and to solve challenging problems for large scale 24x7 business SaaS applications excite you, we would love to talk to you!<br><br><strong>Responsibilities<br><br></strong>As an engineer, you will be responsible for implementing features towards a wide variety of business applications and services within Dynamics 365 products portfolio as well as ensuring they are done to meet rigorous quality standards with the result being software that is used by individuals and businesses throughout the world. In short you will do the following:<br><br><ul><li>Envision, design, implement, test, deploy, maintain, and improve our software components and services </li><li>Embrace and use state-of-the-art new technologies </li><li>Participate in technical discussions and bring new ideas on the table </li><li>Own quality of your code </li><li>Work with Product Managers, Architects and UX Designers to design and specify new features from the engineering standpoint </li><li>Develop software that empowers customers to optimize their business processes </li><li>Author internal tools that improve the teams’ quality and productivity </li><li>Contribute to the positive, solution focused and creative team spirit </li><li>Support less experienced team members in their progress and development <br><br></li></ul>Throughout your tasks, you will work closely with Program Managers and other Software Engineers to optimize design, quality and functionality as Microsoft places a premium on the ability to work well in a team environment.<br><br><strong>Other<br><br></strong><ul><li> Embody our culture and values.<br><br></li></ul><strong>Qualifications<br><br></strong>Required/Minimum Qualifications<br><br><ul><li> Bachelor's Degree in Computer Science, or related technical discipline AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python.</li><li>OR equivalent experience.<br><br></li></ul><strong>Additional Or Preferred Qualifications<br><br></strong><ul><li> Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python.</li><li>OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python.</li><li>OR equivalent experience.</li><li>Experience with design and implementation of enterprise-scale services.</li><li>Experience delivering Dynamics 365 and/or Power Platform solutions desirable.</li><li>Excellent verbal, written, and cross-team collaboration skills are essential to succeed in this role.  </li><li>A team player and collaborator, across time zones and diverse stakeholder groups.  </li><li>Passion for improving software quality and engineering excellence. </li><li>Experience in developing, debugging, and supporting code in object-oriented languages and database querying languages. </li><li>Experience with building infrastructure using Microsoft Azure technology like Service Fabric, App Service, Docker. </li><li>Experience in developing and debugging product and test code within a micro-services architecture.<br><br></li></ul>Software Engineering IC5 - The typical base pay range for this role across the U.S. is USD $137,600 - $267,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $180,400 - $294,000 per year. Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay.<br><br>Microsoft will accept applications for the role until July 26, 2024.<br><br>#CCAROCKS #DYNAMICS365 #WEAREHIRING #WEWANTTOTALKTOYOU! #CUSTOMERCAREAPPLICATIONS<br><br>Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        </div>"], "company_link": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-at-microsoft-3960515336?position=29&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=tDO1P9phPazUsynSt2tqsw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer", "company_name": "Microsoft", "job_location": "Redmond, WA", "job_posted": "11 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Do you have a passion for building scalable and reliable services that power world-class product experiences? If so, you might be the Software Engineer we are looking for. At Microsoft, our mission is to enable every person and every organization on the planet to achieve more. We foster a culture of growth mindset, excellence, and teamwork that inspires us to create life-changing innovations that impact billions of lives around the world. You can be part of our mission and join our diverse and talented team. To learn more, please visit: https://careers.microsoft.com/mission-culture.<br><br>At Microsoft, we treasure those who offer unique viewpoints to our products. Here, developers do more than just code; they significantly influence our product’s trajectory and feature set. We’re cultivating a team that holds diversity in ideas and backgrounds in the same regard as technical expertise. A place where innovation is welcomed, and all are motivated to propose new concepts that enhance our customers’ experiences. Your contributions will not only shape our products but also improve the lives of our customers. Come join us and make an impact.<br><br>Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.<br><br>By applying to this position, you are being considered for multiple like positions within our organization for an invitation-only virtual Interview Day. Position specifics, including hiring team, location, and position details will be determined following the interview process<br><br><ul><li> Embody our Culture and Values<br><br></li></ul><strong>Responsibilities<br><br></strong>Do you have a passion for building scalable and reliable services that power world-class product experiences? If so, you might be the Software Engineer we are looking for. At Microsoft, our mission is to enable every person and every organization on the planet to achieve more. We foster a culture of growth mindset, excellence, and teamwork that inspires us to create life-changing innovations that impact billions of lives around the world. You can be part of our mission and join our diverse and talented team. To learn more, please visit: https://careers.microsoft.com/mission-culture.<br><br>At Microsoft, we treasure those who offer unique viewpoints to our products. Here, developers do more than just code; they significantly influence our product’s trajectory and feature set. We’re cultivating a team that holds diversity in ideas and backgrounds in the same regard as technical expertise. A place where innovation is welcomed, and all are motivated to propose new concepts that enhance our customers’ experiences. Your contributions will not only shape our products but also improve the lives of our customers. Come join us and make an impact.<br><br>Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.<br><br>By applying to this position, you are being considered for multiple like positions within our organization for an invitation-only virtual Interview Day. Position specifics, including hiring team, location, and position details will be determined following the interview process.<br><br><strong>Qualifications<br><br></strong><strong>Required/Minimum Qualifications<br><br></strong><ul><li>Bachelor's Degree in Computer Science or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><ul><li>OR equivalent experience<br></li></ul></ul><strong>Other Requirements<br><br></strong>Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: <br><br><ul><li>Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.  <br><br></li></ul><strong>Additional Or Preferred Qualifications<br><br></strong><ul><li>Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><ul><li>OR equivalent experience.<br></li></ul></ul>Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year.<br><br>There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.<br><br>Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year.<br><br>There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.<br><br>Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay<br><br>Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay<br><br>Microsoft will accept applications and processes offers for these roles on an ongoing basis.<br><br>Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        </div>"], "company_link": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-junior-entry-at-synergisticit-3979466091?position=28&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=YPZPqD7GSWwrn0jh1Sxp2Q%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer - Junior/Entry", "company_name": "SynergisticIT", "job_location": "Palo Alto, CA", "job_posted": "2 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Since 2010 Synergisticit has helped Jobseekers get employed in the tech Job market by providing candidates the requisite skills, experience, and technical competence to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a tech Job we make careers.<br><br>In this Job market also, our candidates can achieve multiple job offers and $100k + salaries.<br><br>please check the below links to see the success outcomes and salaries of our candidates .<br><br>We regularly interact with the Top Tech companies to give our candidates a competitive advantage visit the below videos exhibiting at Oracle Cloud World/Oracle Java One (Las Vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023<br><br>All Positions are open for all visas and US citizens<br><br>We at Synergistic understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like Apple, google, Paypal, Western Union, Client, visa, Walmart lab s etc to name a few.<br><br>Currently, We are looking for entry-level software programmers, Java full-stack developers, Python/Java developers, Data analysts/ Data Scientists, and Machine Learning engineers for full-time positions with clients.<br><br>Who Should Apply Recent Computer Science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and are looking to make their careers in the Tech Industry.<br><br>We assist in filing for STEM extension and also for H1b and Green card filing to Candidates<br><br>We want Data Science/Machine learning/Data Analyst and Java Full stack candidates<br><br>For data Science/Machine learning Positions<br><br><strong>Required Skills<br><br></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br><br>Project work on the technologies needed<br><br>Highly motivated, self-learner, and technically inquisitive<br><br>Experience in programming language Java and understanding of the software development life cycle<br><br>Knowledge of Statistics, Gen AI, LLM, Python, Computer Vision, data visualization tools<br><br>Excellent written and verbal communication skills<br><br>Preferred skills: NLP, Text mining, Tableau, PowerBI, Databricks, Tensorflow<br><br><strong>REQUIRED SKILLS For Java /Full Stack/Software Positions<br><br></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br><br>Highly motivated, self-learner, and technically inquisitive<br><br>Experience in programming language Java and understanding of the software development life cycle<br><br>Project work on the skills<br><br>Knowledge of Core Java, Javascript, C++, or software programming<br><br>Spring boot, Microservices, Docker, Jenkins, Github, Kubernetes, and REST API experience<br><br>Excellent written and verbal communication skills<br><br>If you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team and only connect with candidates who match client requirements.<br><br>No phone calls, please. Shortlisted candidates would be reached out. No third-party or agency candidates or C2C candidates\n        </div>"], "company_link": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "it services and it consulting and civil engineering"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-na-at-the-coca-cola-company-3980829925?position=24&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=0JzT52lgzQlov4jFdeulzQ%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer, NA", "company_name": "The Coca-Cola Company", "job_location": "Atlanta, GA", "job_posted": "11 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          We are seeking a Software Engineer with , backend development experience . All software being developed and delivered using cloud native approach using AWS and Azure . Development work will be heavily focused on java, with some use of Node.js.<br><br><strong>What We Can Do For You<br><br></strong><ul><li>Career Growth: Opportunity to contribute to well-known and highly scalable production platforms like Coca-Cola Freestyle and MyCoke.</li><li>Skill Development: Learn new technologies such as AWS, Azure, and Salesforce.</li><li>Innovation &amp; Technology: Work with a world-class team delivering 100% cloud-native solutions on AWS and Azure.</li><li>Global Exposure: Access to global technology leaders, expanding your network and exposure to emerging technologies and techniques.</li><li>Agile Work Environment: Embrace SAFe agile practices, empowering you to experiment, iterate, and innovate. Gain experience in full lifecycle delivery in a SAFe agile environment.<br><br></li></ul><strong>What You’ll Do For Us<br><br></strong><ul><li>Brainstorm and prototype new concepts and approaches. </li><li>Responsible for developing, implementing, maintain APIs and integrations —including coding and agile team principles. </li><li>Responsible for developing production monitoring and analysis tools for the same.</li><li>Builds strong relationship with Solution Architects and Platform Architects to champion best practices to guide and influence the team on leveraging such practices and creating impactful features from idea to implementation. </li><li>Work with product manager to meet the demands of our customers, while at the same time continuing to innovate far beyond the competition. </li><li>Build strong relationships across the business, that may be leveraged better products and solutions. Be a team player in a highly collaborative environment. </li><li>Takes ownership of projects and work pro-actively under the guidance of a senior developers, maintaining documentation in accordance with the team standards. <br><br></li></ul><strong>Requirements<br><br></strong><ul><li>Bachelor’s degree in Engineering or Computer Science.</li><li>java develop experience + Maven.</li><li>Experience GIT based source control.</li><li>Experience working with REST APIs.</li><li>Strong analytical and problem-solving skills are required <br><br></li></ul><strong>Preferred Qualifications<br><br></strong><ul><li>Experience using Terraform to provision AWS resources</li><li>Experience with AWS: Api Gateway, Lambda, SQS, DynamoDB</li><li>Experience using ARM templated to provision Azure resources</li><li>Experience with Azure Api Management, Azure Functions, Logic Apps</li><li>Experience with MySql</li><li>Experience with Redis</li><li>Experience with Salesforce workbench and sosql.</li><li>Knowledge of Node.js</li><li>Knowledge of Vue.js</li><li>Experience with Jenkins</li><li>Experience with Hibernate and Spring</li><li>Experience with linux command shells and ssh tunnels<br><br></li></ul><strong>Technical Skills<br><br></strong>Java, Jenkins, Maven, Hibernate, Spring, Terraform, ARM templates, AWS (Api Gateway, Lambda, SQS, DynamoDB), MySql, Redis, Salesforce workbench and sosql, Node.js, Vue.js, linux command shells, and ssh tunnels\n        </div>"], "company_link": "https://www.linkedin.com/company/the-coca-cola-company?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "information technology", "industries": "food and beverage services, food and beverage manufacturing, and manufacturing"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-developer-infrastructure-id-9262870817-at-notion-3978901937?position=1&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=3RGthKjjLazuMrg3gW%2F7Hg%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer, Developer Infrastructure ID:9262870817", "company_name": "Notion", "job_location": "San Francisco, CA", "job_posted": "4 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Now hiring in San Francisco, CA<br><br><ul><li>About UsWe're on a mission to make it possible for every person, team, and company to be able to tailor their software to solve any problem and take on any challenge. Computers may be our most powerful tools, but most of us can't build or modify the software we use on them every day. At Notion, we want to change this with focus, design, and craft.We've been working on this together since 2016, and have customers like Pixar, Mitsubishi, Figma, Plaid, Match Group, and thousands more on this journey with us. Today, we're growing fast and excited for new teammates to join us who are the best at what they do. We're passionate about building a company as diverse and creative as the millions of people Notion reaches worldwide.About The RoleMillions of people use Notion — and this number is increasing every day. That means millions of people trust us to deliver a fast, reliable, and secure experience, and we value this more than anything. We want to keep earning trust, while also continuing to amaze our users with the tools they can build in Notion. The Developer Productivity team is responsible for architecting, implementing, and scaling our tools and frameworks that Notion developers use to build these products for our users. We are looking for engineers who are passionate about solving engineering productivity challenges and have deep empathy for other developers.What You'll AchieveTake ownership of the overall development environment and toolchain, and drive novel projects across the company to deliver impact.Minimize time spent between code commit and production deploy, via better tooling, testing, framework, and automation, without sacrificing quality or reliability.Provide top-notch observability tools for Notion engineers to scale Notion reliably.Skills You'll Need To BringDeveloper productivity expert: You bring multiple years of expertise in developer productivity, developer experience or DevOps engineering. You have deep understanding of modern development practices and tools, and experience designing, building, and evaluating those tools.Developer experience mindset: You think critically about how the tools you build will be used by the rest of the engineering team. Your work emphasizes simplicity, supportability, and ease-of-use, and you communicate clearly with other teams to get both structured and unstructured feedback on where we can improve. You have experience supporting developer experience for engineers working on a web client, not just server.Startup mentality: You are comfortable navigating the fast moving, unstructured nature of a fast-growing startup. You are self-motivated to add value and bias towards action. You understand the importance of setting the engineering quality bar for the long term success of our business without shying away from difficult prioritization decisions.Pragmatic and business-oriented: You care about business impact and prioritize projects accordingly. You don't just go after cool stuff—you understand the balance between craft, speed, and the bottom line. To you, technologies and programming languages are about tradeoffs. You may be opinionated, but you're not ideological and can learn new technologies as you go.Nice To HavesYou have a deep understanding of TypeScript and how to keep it running smoothly in a large codebase.You’ve untangled complex codebases with interwoven dependencies to improve developer productivity and tooling speed without compromising reliability.You have experience in scaling developer experience a hyper-growth startupYou can independently lead a small team and multi-month project end to end to accomplish team goals.We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco, the estimated base salary range for this role is $145,000 - $250,000 per year.J-18808-Ljbffr</li></ul>\n        </div>"], "company_link": "https://www.linkedin.com/company/notionhq?trk=public_jobs_topcard-org-name", "seniority_level": "mid-senior level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-2-fullstack-frontend-at-intuit-3944661143?position=23&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=G1VwNgdEuz50S35XTzdRSw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer 2 - Fullstack - Frontend", "company_name": "Intuit", "job_location": "San Diego, CA", "job_posted": "11 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Overview<br><br></strong>Come join the Intuit Expert Portal (IEP) team as a Software Engineer 2. The IEP team is responsible for a rapidly expanding platform that enables Intuit’s Live product line -- including TurboTax Live, and QuickBooks Live.<br><br>What you'll bring<br><br><ul><li>BS/MS in computer science or equivalent work experience</li><li>1+ years experience developing web, software, or mobile applications</li><li>1+ years experience with JavaScript and React</li><li>Solid grasp of software engineering fundamentals and their practical application </li><li>An understanding of the Software Development Life Cycle (SDLC)</li><li>An understanding and preferable experience with web services (REST or SOAP)</li><li>An understanding of unit testing &amp; Test Driven Development (TDD)</li><li>\"Self-starter\"\" attitude and ability to make decisions independently</li><li>Helpful, can-do attitude and a willingness to take ownership of problems</li><li>Strong desire to learn and grow</li><li>Excellent problem-solving skills with a history of superb delivery against assigned tasks </li><li>Excellent verbal and written communication skills</li><li>Outstanding partnership skills<br><br></li></ul>How you will lead<br><br><ul><li>Successful delivery of high quality React and/or JavaScript based web software (requirements, design, code, documentation, etc.)</li><li>Roughly 80-95% hands-on coding</li><li>Contribute to early quality activities, including peer reviews of estimates, designs and code</li><li>Resolve defects/bugs during QA testing, pre-production, production, and post-release patches</li><li>Partner effectively with all team members to deliver against commitments</li><li>Work cross-functionally with various Intuit teams: product management, QA/QE, various product lines, or business units to drive forward results</li><li>Commitment to team success and positive team dynamics</li><li>Passion for growing and applying technical skills in service to customers</li><li>Experience with Agile Development, SCRUM, and/or Extreme Programming methodologies</li></ul>\n        </div>"], "company_link": "https://www.linkedin.com/company/intuit?trk=public_jobs_topcard-org-name", "seniority_level": "associate", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-i-at-battelle-3980875907?position=22&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=xCdgRQbckyoQvWYUo0ppoA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer I", "company_name": "Battelle", "job_location": "Columbus, OH", "job_posted": "4 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Battelle delivers when others can’t. We conduct research and development, manage national laboratories, design and manufacture products and deliver critical services for our clients—whether they are a multi-national corporation, a small start-up or a government agency.<br><br>We recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply.<br><br><strong>Job Summary<br><br></strong>Battelle’s Cyber Solutions Division (CSD) is seeking an entry-level <strong>Software Engineer</strong> to work in our <strong>Columbus, OH, or Chantilly, VA</strong>, locations. The position reports to the Division Manager of Cyber Solutions. CSD is responsible for ideating, developing, and deploying advanced technical solutions to solve the most challenging national security problems. This position is contingent upon award.<br><br>“From Silicon to Systems” – Battelle cyber is an elite, multi-disciplinary team, bringing together the brightest minds from physics, computer science, electrical engineering, data science, and mathematics to develop unique cyber solutions for government and commercial customers. Battelle has been trusted by elite government clients to solve some of the world’s hardest cyber problems. We work in small agile teams to push the bounds of computing technology. Our high-powered labs include specialized software and hardware, so our engineers have everything they need to invent new cyber solutions. We especially want people with national security experience, an enthusiasm for learning and problem solving, and who can implement technical solutions with direct application to client S&amp;T mission areas.<br><br><strong>Battelle Cyber Online<br><br></strong>GitHub: https://github.com/Battelle<br><br>Battelle Cyber Challenge: https://battellecyberchallenge.org/<br><br>Battelle Cyber: https://www.youtube.com/watch?v=XqMuKsqH9wc<br><br>Battelle Cyber Solutions Division: Cyber Solutions | Battelle Solution<br><br><strong>Responsibilities<br><br></strong>As a Software Engineer I at Battelle, you will spend your day designing, coding, and testing software. Our projects are non-standard, highly customized, and will push you to new levels as a software engineer. You will work with customers and team members to understand project requirements and scope, design/develop/modify software and firmware for custom memory constrained hardware and related systems. You will work with internal and external customers to understand and set goals and expectations and translate and communicate those goals and expectations to the team. You will research and analyze new libraries, technologies, and tools and perform full software life cycle functions including software/firmware requirements, architecture, design, code, test, integration, and documentation.<br><br><strong>Key Qualifications<br><br></strong><ul><li>Bachelor’s degree in related field; or an equivalent combination of education and/or experience in a related field</li><li>Experience with or ability to understand compiled languages and memory management (e.g., C, C++)</li><li>Experience with or ability to understand interpreted languages (Python)</li><li>Competency in object-oriented programming</li><li>Familiarity with development tools (e.g., Visual Studio Code, PyCharm, Eclipse)</li><li>Familiarity with version control systems (git)</li><li>Demonstrated understanding of common debugging tools and how to use them (e.g., GDB, Visual Studio Code debugger</li><li>Ability to work in Linux-based Operating Systems (e.g., Ubuntu, RedHat, CentOS.)</li><li>Understanding of TCP/IP networking fundamentals</li><li>Familiarity with Agile methodologies</li><li>Ability to work individually and in small, fast paced team environments</li><li>Passion and drive to constantly improve your skill set</li><li>Ability to develop, test, document, and maintain code for deadline-driven projects</li><li>Ability to participate in requirements-gathering process, provide user documentation, and comment code clearly</li><li>Must be a US citizen with an active TS/SCI. <br><br></li></ul><strong>Preferred Qualifications<br><br></strong><ul><li>Experience with or ability to write unit and integration tests to verify code functionality</li><li>Experience with or understanding of relational databases</li><li>Experience with or understanding of NoSQL databases (e.g., MongoDB, Redis, MarkLogic, Cassandra, etc.)</li><li>Understanding of supervised and unsupervised machine learning techniques</li><li>Familiarity with machine learning libraries such as Tensorflow, Pytorch, Scikit-Learn, etc. </li><li>Familiarity with data pipelines to process and distribute data such as NiFi, Apache Spark, Airflow and/or Prefect</li><li>Familiarity with microservices architecture, containerization, and container orchestration software (e.g., Docker, CRI-O, Docker Swarm, Kubernetes, Marathon)</li><li>Familiarity with cloud computing and associated service providers such as Amazon Web Services (AWS) and Microsoft Azure</li><li>Familiarity with web development technologies such as HTML, XML, JSON, CSS, or JavaScript/Typescript</li><li>Understanding of user interface and user experience design and implementation</li><li>Full scope polygraph. <br><br></li></ul><strong>Some Of Thethe Extras That Make Working Here Great<br><br></strong><ul><li>Learn (tuition assistance, paid training) and teach (get published, speak at a conference)</li><li>Software and Intellectual Property development royalty sharing</li><li>Mentorship and learning culture</li><li>Internally funded and guided research projects with large amounts of individual autonomy<br><br></li></ul><strong>Work Environment <br><br></strong>Battelle has been trusted by elite government clients to solve some of the world’s hardest security problems. We work in small agile teams to push the bounds of computing technology. Our high-powered labs include specialized software and hardware, so our engineers have everything they need to invent new Cyber solutions. Team members can work flexible hours, and Battelle maintains a 9/80 schedule meaning employees have a chance to take every other Friday off depending on client needs.<br><br>We encourage new ideas with our large Independent Research and Development (IRAD) program where engineers work on projects they are passionate about. Inventors and innovators are rewarded by our industry-leading IP compensation program. Our group works collaboratively with many parts of Battelle’s larger organization on projects ranging from genomics to robotics.<br><br><strong>Benefits: Live an Extraordinary Life<br><br></strong>We care about your well-being, not just on the job. Battelle offers comprehensive and competitive benefits to help you live your best life.<br><br><ul><li>Balance life through a compressed work schedule: Most of our team follows a flexible, compressed work schedule that allows for every other Friday off—giving you a dedicated day to accomplish things in your personal life without using vacation time. </li><li>Take time to recharge: You get paid time off to support work-life balance and keep motivated. </li><li>Prioritize wellness: Stay healthy with medical, dental, and vision coverage with wellness incentives and benefits plus a variety of optional supplemental benefits. </li><li>Better together: Coverage for partners, gender-affirming care and health support, and family formation support. </li><li>Build your financial future: Build financial stability with an industry-leading 401(k) retirement savings plan. For most employees, we put in 5 percent whether you contribute or not, and match your contributions on top of that. </li><li>Advance your education: Tuition assistance is available to pursue higher education. </li><li>Flexible work arrangements: You have options for where you work and when you work. <br><br></li></ul><strong>A Work Environment Where You Succeed<br><br></strong>For brilliant minds in science, technology, engineering and business operations, Battelle is the place to do the greatest good by solving humanity’s most pressing challenges and creating a safer, healthier and more secure world.<br><br>You will have the opportunity to thrive in a culture that inspires you to:<br><br><ul><li>Apply your talent to challenging and meaningful projects </li><li>Receive select funding to pursue ideas in scientific and technological discovery</li><li>Collaborate with world-class experts in an inclusive environment</li><li>Nurture and develop the next generation of scientific leaders</li><li>Give back to and improve our communities<br><br></li></ul><strong>Vaccinations &amp; Safety Protocols<br><br></strong><em>Battelle may require employees, based on job duties, work location, and/or its clients’ requirements to follow certain safety protocols and to be vaccinated against a variety of viruses, bacteria, and diseases as a condition of employment and continued employment and to provide documentation that they are fully vaccinated. If applicable, Battelle will provide reasonable accommodations based on a qualified disability or medical condition through the Americans with Disabilities Act or the Rehabilitation Act or for a sincerely held religious belief under Title VII of the Civil Rights Act of 1964 (and related state laws).<br><br></em><em>Battelle is an equal opportunity employer. We provide employment and opportunities for advancement, compensation, training, and growth according to individual merit, without regard to race, color, religion, sex (including pregnancy), national origin, sexual orientation, gender identity or expression, marital status, age, genetic information, disability, veteran-status veteran or military status, or any other characteristic protected under applicable Federal, state, or local law. Our goal is for each staff member to have the opportunity to grow to the limits of their abilities and to achieve personal and organizational objectives. We will support positive programs for equal treatment of all staff and full utilization of all qualified employees at all levels within Battelle.<br><br></em>The above statements are intended to describe the nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, activities and skills required of staff members. <strong>No statement herein is intended to imply any authorities to commit Battelle unless special written permission is granted by Battelle's Legal Department.<br><br></strong>For more information about our other openings, please visit www.battelle.org/careers\n        </div>"], "company_link": "https://www.linkedin.com/company/battelle?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "defense and space manufacturing, aviation and aerospace component manufacturing, and biotechnology research"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-fe-at-shipt-3980867836?position=21&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=0F1NDP%2BkLRuPQYlSCkG9dg%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer (FE)", "company_name": "Shipt", "job_location": "Greater Birmingham, Alabama Area", "job_posted": "5 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Impact<br><br></strong>As a Frontend Engineer in the Partner &amp; Coverage Tooling team at Shipt, you will play a pivotal role in delivering innovative features and enhancing user experiences across various business areas, including Partner Operations &amp; Success, Network Planning, Admin Internal Tooling, and more. You will collaborate daily with a dedicated team of front-end engineers using a React/Typescript/GQL stack, driving solutions across multiple platforms in close partnership with backend, design, and product teams.<br><br>Your responsibilities will include contributing and/or leading feature work, participating in code reviews, mentoring junior associates, engaging in scrum ceremonies such as sprint planning and backlog refinement, troubleshooting and debugging front-end issues for non-technical users, and maintaining code quality across repos using the right instrumentation.<br><br><strong><strong>What You’ll Need to Be Successful<br><br></strong></strong><ul><li>2+ years of experience with React and TypeScript: Proven expertise in building and maintaining web applications using these technologies.</li><li>Experience with state management libraries (e.g., Context API, Jotai, Mobx, Redux): Ability to manage complex application states effectively.</li><li>Excellent communication skills: Ability to articulate ideas clearly and work collaboratively with cross-functional teams.</li><li>Experience with GraphQL (GQL): Enhances API development and query efficiency.</li><li>Strong problem-solving skills and critical thinking: Ability to diagnose issues, find solutions, and think critically about the impact of your work from a development and business perspective with minimal supervision.</li><li>Proficiency in Testing: A foundational understanding of various types of testing, including unit, integration and e2e.<br><br></li></ul><strong>Work Arrangement<br><br></strong>Shipt considers candidates located near a Shipt office or workspace in Birmingham, San Francisco, or Minneapolis to be hybrid, which means that they have the flexibility to work from home (with leader approval) or at a Shipt office in order to facilitate the ability to innovate, collaborate, and spark team connections. In-office expectations will vary by role and leader. Certain roles may require in-office presence on a full-time basis. Please work with your recruiter to learn more about the classification of this role.<br><br><strong>About Shipt<br><br></strong>Shipt is a retail tech company that connects people to reliable, high-quality delivery with a personal touch. Shipt connects customers to the things they want from the stores they love, retail businesses to more satisfied customers, and workers to new earning opportunities.<br><br>At Shipt, we aim to put our team first to boost a sense of belonging, spark opportunities for growth, provide unique benefits and commit to giving back to our communities in ways that make life better, both personally and professionally. We understand that our service, our culture, and our connection to our communities are only made better by every single person who shows up to work here every day. Learn More.<br><br>Shipt is an independently operated, wholly owned subsidiary of Target Corporation and available in more than 5,000 U.S. cities. Shipt was founded and is headquartered in Birmingham, Alabama. For more information, please visit Shipt’s company site at Shipt.com.<br><br><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, color, national origin, ethnicity, religion or religious belief, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, military or veteran status, disability, or any other characteristic protected by law.<br><br></em><em>Please inform your recruiting contact upon initial connection if you need any accommodations.<br><br></em><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br></em><em>Employees (and eligible family members) are covered by medical, dental, vision and more. Employees may enroll in our company’s 401k plan. Employees will also be eligible to receive discretionary vacation for exempt team members, paid holidays throughout the calendar year and paid sick leave. Other compensation includes eligibility for an annual bonus and the potential for restricted stock units based on role.<br><br></em><strong>Pay Range<br><br></strong>Metro Areas of Boston, District of Columbia, Seattle and New York City:<br><br>$74,732-$149,463<br><br><strong>Metro Areas Of Los Angeles And San Francisco<br><br></strong>$115,763.35-$149,463<br><br>All other locations:<br><br>$62,186-$124,481<br><br><em>Please note that the salary range above is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level, competencies, and work location.</em>\n        </div>"], "company_link": "https://www.linkedin.com/company/shipt?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-co-op-fall-semester-at-calero-3978271426?position=27&pageNum=0&refId=ShBDDR5rTjfupeSCRjjVjA%3D%3D&trackingId=g0NYQXgy9wA1nr1b8Cuwaw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer Co-op- Fall Semester", "company_name": "Calero", "job_location": "Rochester, NY", "job_posted": "", "exact_date": "", "description": [], "company_link": null},
{"job_link": "https://www.linkedin.com/jobs/view/principal-software-engineer-at-sofi-3944543989?position=4&pageNum=30&refId=KTgfpnk5n9I5%2F%2B7Oa9Y3sA%3D%3D&trackingId=e%2BNT59xEv8Fkex1JOdvXtA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Principal Software Engineer", "company_name": "SoFi", "job_location": "San Francisco, CA", "job_posted": "11 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Employee Applicant Privacy Notice<br><br></strong><strong>Who we are:<br><br></strong>Shape a brighter financial future with us.<br><br>Together with our members, we’re changing the way people think about and interact with personal finance.<br><br>We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. <strong>Join us to invest in yourself, your career, and the financial world.<br><br></strong><strong>The Role<br><br></strong>We are seeking a Principal Software Engineer to join our FROST team (Fraud, Risk, Operations, Safety, Trust) that delivers critical software systems and services that serve our Members in their journey to Get Their Money Right. In this role you will lead ambiguous &amp; complex work across multiple teams, divisions and organizations as the most senior technical contributor. Your responsibility will include mentorship for engineers, leadership in shaping standards for technical design and execution, hiring practices, and operational excellence.<br><br>The ideal candidate is both forward-thinking and hands-on, has a strong sense of ownership and drive for delivery. This role is inherently cross-functional and you will work closely with engineering, product, marketing, risk, compliance, data science, operations, legal, and executive teams to set forth a strategy, define, and prioritize a vision. You’ll play the critical role of bridging the technical and business worlds to deliver solutions that enable our engineers to get things done while driving our business forward, while also bridging engineering systems across products and teams in shaping the broader technical architecture. You’ll face and solve a wide range of challenges: technical, product, and operational, shaping your personal growth and career along the way.<br><br><strong>What you’ll do:<br><br><br></strong><ul><li>Deliver high quality designs and code at scale that benefit our users, while communicating with groups in and outside our engineering teams.</li><li>Make significant contributions to the technical architecture of the various products and systems.</li><li>Generate ideas for new business-impacting initiatives and ways of leveraging technology in the pursuit of our goals.</li><li>Advocate for engineering best practices and drive rigorous hiring and coding standards, and overall raise the bar on technical excellence.</li><li>Develop, apply, and socialize advanced technologies, engineering principles, theories and concepts.</li><li>Work across teams at SoFi to help develop &amp; enhance products and systems. This role offers a unique chance to touch virtually every feature in SoFi's digital touchpoints.</li><li>Provide technical mentorship to engineers.</li><li>Lead &amp; present in broad forums with senior technical leaders across the company.<br><br><br></li></ul><strong>Who you are:<br><br><br></strong><ul><li>You demonstrate extremely high levels of technical knowledge, ingenuity and creativity.</li><li>You are customer-obsessed and have an affinity for solving complex problems and shipping impactful features, and make pragmatic high judgment decisions without letting perfection become the enemy of progress.</li><li>You work and play well with others; SoFi is a highly collaborative workplace and a melting pot of diverse talent.</li><li>You are confident in asking difficult questions and challenging your team while also keenly listening and taking feedback.</li><li>You are a voracious learner - you have the ability to quickly and independently acquire proficiency in new languages and technologies.</li><li>You value mentorship and constantly look for ways to improve the technical depth of the individuals on your teams.<br><br><br></li></ul><strong>What you’ll need:<br><br><br></strong><ul><li>10+ years programming experience, with significant experience in a JVM-based language and familiarity with Spring.</li><li>Expert understanding and hands-on experience building and operating large-scale fault-tolerant distributed systems, workflows, databases and mobile/web applications</li><li>Deep understanding of code release, deployment orchestration / rollout mechanisms, logging, instrumentation, monitoring, and alerting in a microservices environment.</li><li>Experience with public cloud infrastructure, preferably AWS.</li><li>Excellent verbal and written communication skills.<br><br><br></li></ul><strong>Nice to Have:<br><br><br></strong><ul><li>Experience building and scaling Machine Learning systems<br><br><br></li></ul><strong>Compensation And Benefits<br><br></strong>The base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.<br><br>To view all of our comprehensive and competitive benefits, visit our <strong>Benefits at SoFi </strong>page!<br><br>SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.<br><br>The Company hires the best qualified candidate for the job, without regard to protected characteristics.<br><br>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br>New York applicants: Notice of Employee Rights<br><br>SoFi is committed to embracing diversity. As part of this commitment, SoFi offers reasonable accommodations to candidates with physical or mental disabilities. If you need accommodations to participate in the job application or interview process, please let your recruiter know or email accommodations@sofi.com.<br><br>Due to insurance coverage issues, we are unable to accommodate remote work from Hawaii or Alaska at this time.<br><br><strong>Internal Employees<br><br></strong>If you are a current employee, do not apply here - please navigate to our Internal Job Board in Greenhouse to apply to our open roles.\n        </div>"], "company_link": "https://www.linkedin.com/company/sofi?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "financial services"},
{"job_link": "https://www.linkedin.com/jobs/view/software-development-engineer-in-test-sdet-at-energy-jobline-3979205855?position=7&pageNum=80&refId=iGQ4KBLPDGifhHRkMR6GsA%3D%3D&trackingId=XevB2COehllO5sFBfZv3Xw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "SOFTWARE DEVELOPMENT ENGINEER IN TEST (SDET)", "company_name": "Energy Jobline", "job_location": "Atlanta, GA", "job_posted": "16 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          \" Design, develop, execute and maintain software to test the product/application<br><br>\" Define automation strategy, automation cases as well as Design tools for unit, functional, and performance testing in a programmatic manner<br><br>\" Participate in design and code inspections.<br><br>\" Propose improvements to our existing processes and build automated tools, libraries and utilities in order to improve the team s speed, quality and efficiency.<br><br>\" The testing code you write should expose defects in production level code as well as defects at the component and feature integration perspective<br><br>\" Work with a wide variety of technologies from front-end UI to back-end distributed web services<br><br>\" Own the design and implementation of tests that will help in end-to-end quality of major deliverables working closely with multiple engineers and teams to execute them<br><br>\" Integration of both the tests and infrastructure automation into the CI/CD pipeline is also a key responsibility in this position<br><br>\" Contribute to agile development teams following 12 Factor application development principles<br><br>\" Collaborate effectively within team environment<br><br>Quals--<br><br>2 to 3 years of experience in Information Technology with expertise in test automation of applications from UI and API layer. \" Candidate should have hands on experience of writing, maintaining automated UI and APIs tests written in Java, JavaScript, C#, Python using various open-source testing libraries like Selenium, Cypress, REST Assured, etc. \" Hands on experience in OOPs like Java, C# and scripting like Python, Perl,Shell, Bash etc. \" Experience with API and Microservices testing and automation \" Knowledge and experience with Test Driven Development(TDD),Behavior Driven Development(BDD) with a testing framework like Cucumber,JBehave \" Hands on experience with one or more querying such SQL (), Oracle, MySQL and/or No SQL databases (Cassandra, MongoDB etc) \" Experience deploying applications in AWS or OpenShift (Kubernetes) \" Hands on experience in automating backend REST services including writing custom functions using tools such as Postman, REST Assured, Karate,Cypress, Ready API etc. \" Hands on experience of building test automation framework from ground up using modular framework and design pattern like Page Object Model design pattern (POM) etc. \" Experience of working in distributed agile teams using agile frameworks such as SCRUM , SAFe, XP etc. \" Hands on experience of working with continues integration tools such Jenkins, Circle CI. \" Able to independently create and maintain automation test jobs using tools such as Jenkins. \" Hands on experience working with source code management tools such as GitLab, GitHub, AWS Code Commit etc. \" Hands on experience of creating test reports from automation test run using tools such as cucumber report, Extent report etc. \" Ability to quickly adapt to new tools and evolving technologies. \" Must have the ability to clearly communicate with peers, business analysts, and subject matter experts \" Must have the ability to listen to customers and colleagues; convey ideas effectively; prepare written documentation \" Proactive in nature with customer satisfaction as a primary goal \" Excellent verbal and written communication. \" Embraces Diverse people, thinking and styles \" Consistently makes safety and security, of self and others, the priority QUALIFICATIONS \" Knowledge and experience with the Travel Industry \" Infrastructure automation using docker and tools like Chef, Puppet, Terraform \" Experience of working with various AWS cloud services such as EC2, s3 bucket, AWS code pipeline, CloudFormation, etc. \" Hands on experience of virtualizing services for test automation using tools such as Wire Mock, Mockito etc. \" Experience of working with test management and agile management tools such as VersionOne, qTest etc. \" Experience of working with container orchestration tools such as docker, RED Hat OpenShift, AWS CloudFormation. \" Experience of non-functional testing such as performance, load, stress, security, accessibility and usability testing.\n        </div>"], "company_link": "https://uk.linkedin.com/company/energy-jobline?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "staffing and recruiting"},
{"job_link": "https://www.linkedin.com/jobs/view/data-engineer-at-arch-3960295345?position=10&pageNum=57&refId=hwyfgnKuYe4bodzbD1YqDw%3D%3D&trackingId=%2Bntq7R5qPgUW%2FaeWNZ7mOA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Data Engineer", "company_name": "Arch", "job_location": "New York, NY", "job_posted": "11 hours ago", "exact_date": "2024-07-20", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Department: </strong>Operations-Engineering<br><br><strong>Employment Type: </strong>Full Time<br><br><strong>Location: </strong>New York<br><br><strong>Compensation: </strong>$70,000 - $100,000 / year<br><br><strong>Description<br><br></strong><strong>Our Company<br><br></strong>Private investments such as venture capital, hedge funds, and private equity, make up roughly 25% of the entire investments universe. Traditionally, investors, family offices, and managers track hundreds of investments in complicated spreadsheets, file folders, and busy email boxes. Not only is this tedious and time-consuming, but it is rife with opportunity for manual data entry errors, inconsistent reporting, and lost information. Enter, Arch.<br><br>Arch is a fintech startup that digitizes and automates portfolio management and document collection for private investments. With Arch, investors can rest assured knowing all of their investment information and data is organized, accurate, and secure.<br><br>We are a small company responsible for billions of dollars in investments, and we are looking to hire in all parts of our company as we are quickly growing. As a <strong>Data Engineer</strong>, you'll write much of the code for processing and organizing data from hundreds of sources in thousands of formats, keeping Arch's data organized as we continue to scale and grow our company.<br><br><strong>The role<br><br></strong>The Data Engineer role at Arch is a role whose responsibilities are tightly aligned with the efficiency and overall success of the Operations team.<br><br><strong>Key Responsibilities<br><br></strong>As a<strong> Data Engineer</strong>, you will be an integral part of our growing Operations team. In this role, you will be responsible for:<br><br><ul><li>Diving into and mastering the many sources and formats of alternative investment data.</li><li>Maintaining, refining, and augmenting Arch data processing pipelines.</li><li>Both applying traditional data ingestion methods and making use of generative AI where relevant.</li><li>Tracking and improving Arch's data quality and processing efficiency.<br><br></li></ul><strong>Skills, Knowledge And Expertise<br><br></strong>Reach out to us if you:<br><br><ul><li>Are proficient in JavaScript or another mainstream programming language</li><li>Know SQL</li><li>Are a quick learner who enjoys partnering with others and solving difficult problems</li><li>Are interested in alternative investments and/or financial services<br><br></li></ul><strong>Bonus Points If You<br><br></strong><ul><li>Enjoy writing code to process and understand data</li><li>Are familiar with the terms capital calls, IRRs, recallable distributions, or K-1s</li><li>Have taken finance or accounting courses<br><br></li></ul><strong>Some Perks Of Working For Arch Include<br><br></strong><ul><li> Your work is high impact - Being one of just a few people responsible for the company means you have real responsibility and impact from day one. You'll be involved in discussions that drive the growth and direction of our platform from the very beginning.</li><li> You'll learn a lot about a lot - You get to learn about all aspects of the business and touch every system that's part of the product. Our team has helped bring previous companies from early stages to success and has intimate knowledge of the industry and we can quickly bring you up to speed.</li><li> Low bureaucracy - We may be small, but that means we're nimble and can move quickly. New changes are being added to our platform every day, and we're always looking for ways to do things better. We move fast and if a feature or process doesn't make sense or could be more efficient, you always have the power to make it better.</li><li> Team community and camaraderie - We are a small team, and we have enormous trust in each other and always do what we can do to support one another. We're always ready to step in to help.</li></ul>\n        </div>"], "company_link": "https://www.linkedin.com/company/archsoftware?trk=public_jobs_topcard-org-name", "seniority_level": "associate", "employment_type": "full-time", "job_function": "information technology", "industries": "financial services"}
]