[
{"job_link": "https://www.linkedin.com/jobs/view/junior-frontend-engineer-javascript-html-css-at-patterned-learning-career-3975571557?position=37&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=zz1dJBwXiZAQ5zQyPrDELw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Junior Frontend Engineer (JavaScript/HTML/CSS)", "company_name": "Patterned Learning Career", "job_location": "Salt Lake City, UT", "job_posted": "4 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong>Junior Frontend Engineer (JavaScript/HTML/CSS) - Remote Job, 1+ Year Experience<br><br></strong><strong>Annual Income:</strong> $58K - $74K<br><br><strong>A valid work permit is necessary in the US<br><br></strong><strong>About us:</strong> Patterned Learning is a platform that aims to help developers code faster and more efficiently. It offers features such as collaborative coding, real-time multiplayer editing, and the ability to build, test, and deploy directly from the browser. The platform also provides tightly integrated code generation, editing, and output capabilities.<br><br><strong>Responsibilities<br><br></strong><ul><li>Autonomy of project implementation </li><li>Efficient in coding review </li><li>Reporting directly to owners </li><li>Agile work-flow </li><li>Building customer-facing applications </li><li>Meta-development opportunities <br><br></li></ul>The Successful Applicant<br><br><ul><li>Front-end web experience coding in JavaScript/HTML/CSS. </li><li>Willing to mentor junior talent. </li><li>Eager to move into a lead role with rapid expected company growth. </li><li>Comfortable working in a remote role. </li><li>A dependable individual who can take initiative in cleaning up and expanding projects. <br><br></li></ul>Benefits:<br><br><ul><li>Competitive salary and benefits package. </li><li>Remote work flexibility! Enjoy the freedom and convenience of working from anywhere with a stable internet connection. </li><li>Opportunity to work on challenging and impactful projects that drive business results. </li><li>Collaborative and supportive work environment. </li><li>Continuous learning and development opportunities. <br><br></li></ul><strong>Why Patterned Learning LLC?<br><br></strong>Patterned Learning can provide intelligent suggestions, automate repetitive tasks, and assist developers in writing code more effectively. This can help reduce coding errors, improve productivity, and accelerate the development process.<br><br>Pattern recognition is particularly relevant in the context of coding. Neural networks, especially deep learning models, are commonly employed for pattern detection and classification tasks. These models simulate human decision-making and can identify patterns in data, making them well-suited for tasks like code analysis and generation.<br><br>\n        </div>"], "company_link": "https://www.linkedin.com/company/patterned-learning-career?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "information technology", "industries": "it services and it consulting"},
{"job_link": "https://www.linkedin.com/jobs/view/junior-%E2%80%8Bfull-stack-web-developer-at-patterned-learning-career-3975574132?position=39&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=edZ8sCbz35mOvPLiDo2MDg%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Junior Full Stack Web Developer", "company_name": "Patterned Learning Career", "job_location": "Virginia Beach, VA", "job_posted": "4 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong>Junior Full Stack Web Developer - Remote Job, 1+ Year Experience<br><br></strong><strong>Annual Income:</strong> $59K - $75K<br><br><strong>A valid work permit is necessary in the US<br><br></strong><strong>About us:</strong> Patterned Learning is a platform that aims to help developers code faster and more efficiently. It offers features such as collaborative coding, real-time multiplayer editing, and the ability to build, test, and deploy directly from the browser. The platform also provides tightly integrated code generation, editing, and output capabilities.<br><br>Description:<br><br>This position is ideal for individuals who are passionate about both front-end and back-end development and want to gain valuable experience in a supportive and collaborative environment.<br><br>Responsibilities:<br><br><ul><li>Collaborate with the development team to design, develop, and maintain web applications </li><li>Implement responsive and user-friendly front-end designs using HTML, CSS, and JavaScript </li><li>Develop server-side code and APIs using programming languages such as Python, Ruby, or Node.js </li><li>Design and maintain databases and perform database queries for data retrieval and manipulation </li><li>Write clean, modular, and efficient code for both front-end and back-end components </li><li>Participate in code reviews and provide constructive feedback </li><li>Troubleshoot and debug issues to ensure optimal performance and user experience </li><li>Stay up-to-date with emerging web technologies and industry trends </li><li>Contribute to improving the overall web development process <br><br></li></ul>Requirements:<br><br><ul><li>Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience) </li><li>Strong knowledge of HTML5, CSS3, and JavaScript </li><li>Experience with front-end frameworks (such as React, Angular, or Vue.js) </li><li>Proficiency in at least one server-side programming language (Python, Ruby, Node.js, etc.) </li><li>Familiarity with databases and SQL </li><li>Understanding of RESTful APIs and web services </li><li>Experience with version control systems (e.g., Git) </li><li>Good problem-solving and analytical skills </li><li>Excellent communication and teamwork abilities <br><br></li></ul>Preferred Qualifications:<br><br><ul><li>Familiarity with back-end frameworks (such as Django, Ruby on Rails, Express, etc.) </li><li>Knowledge of NoSQL databases (MongoDB, Firebase, etc.) </li><li>Understanding of web security best practices </li><li>Familiarity with cloud platforms (AWS, Azure, Google Cloud) </li><li>Experience with testing frameworks (Jest, Mocha, Jasmine, etc.) </li><li>Projects or personal portfolio showcasing your full-stack development skills <br><br></li></ul><strong>Why Patterned Learning LLC?<br><br></strong>Patterned Learning can provide intelligent suggestions, automate repetitive tasks, and assist developers in writing code more effectively. This can help reduce coding errors, improve productivity, and accelerate the development process.<br><br>Pattern recognition is particularly relevant in the context of coding. Neural networks, especially deep learning models, are commonly employed for pattern detection and classification tasks. These models simulate human decision-making and can identify patterns in data, making them well-suited for tasks like code analysis and generation.<br><br>\n        </div>"], "company_link": "https://www.linkedin.com/company/patterned-learning-career?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "information technology", "industries": "it services and it consulting"},
{"job_link": "https://www.linkedin.com/jobs/view/jr-software-development-engineer-san-diego-jr-developer-program-at-amazon-3915049285?position=33&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=lLQq9gjlOJCX5IT4aHFosA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Jr. Software Development Engineer - San Diego, Jr. Developer Program", "company_name": "Amazon", "job_location": "San Diego, CA", "job_posted": "7 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Description<br><br></strong>Amazon is looking for a highly-motivated Jr. Software Development Engineer (SDE)! Jr. SDEs write real software and collaborate with experienced software engineers who provide guidance and opportunities for ownership on projects that matter to our customers. As a year-round intern, Jr. SDEs become fully integrated into their teams and regularly contribute to impactful deliverables. Your design and code will contribute to solving some of Amazon's most complex technical challenges.<br><br>The Jr. SDE role is part of Amazon's Jr Developer Program - a year-round internship opportunity that offers a symbiotic relationship between work and school. Jrs. receive 1:1 mentoring throughout their time in the program, receiving guidance and insight from a full-time Amazonian on their team. Because of the internship's extended tenure, our Jrs. become immersed in an Amazon team and gain real-life technical experience. Flexible part-time schedules during the school year and full-time employment over the summer creates an environment where students can succeed in both their work and their education. San Diego has a growing population of Jrs, allowing for deep connections with fellow students engaged in similar roles.<br><br>Upon successful completion of the Jr. Developer Program, the opportunity for full-time employment may be available at an Amazon corporate site.<br><br><strong>Role Highlights<br><br></strong><ul><li> Part-time work during the school year (16 hours/week)</li><li> Full-time work during the summer (40 hours/week)</li><li> 1:1 mentoring with an experienced Software Engineer</li><li> Effective performance management and integrated opportunities for growth<br><br></li></ul>We are open to hiring candidates to work out of one of the following locations:<br><br>San Diego, CA, USA<br><br><strong>Basic Qualifications<br><br></strong><ul><li> Currently enrolled in an accredited college or university Bachelor's or Master's degree program.</li><li> Majoring in Computer Science, Software Engineering, or related STEM field.</li><li> Graduating between June 2026 and June 2027.</li><li> Ability to work year-round until graduation (part-time during the school year and full-time during the summer).</li><li> Living within commutable distance to San Diego, CA and able to work in-person year-round.</li><li> Programming experience with at least one modern language such as Java, Python, or C++ including object-oriented design.<br><br></li></ul><strong>Preferred Qualifications<br><br></strong><ul><li> Previous technical internship(s), if applicable.</li><li> Ability to effectively articulate technical challenges and solutions.</li><li> Adept at handling ambiguous or undefined problems as well as ability to think abstractly.<br><br></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br><br>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $15/hr in our lowest geographic market up to $75.63/hr in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br><br><br><strong>Company</strong> - Amazon.com Services LLC<br><br>Job ID: A2630256\n        </div>"], "company_link": "https://www.linkedin.com/company/amazon?trk=public_jobs_topcard-org-name", "seniority_level": "associate", "employment_type": "full-time", "job_function": "information technology, consulting, and engineering", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/junior-software-engineer-at-syntax-data-3974399242?position=35&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=efdfx%2BjBO3PORZ6%2F8juXgQ%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Junior Software Engineer", "company_name": "Syntax Data", "job_location": "United States", "job_posted": "", "exact_date": "", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Syntax LLC is a financial data and technology company that codifies business models into a relational system we call Affinity Data™. Syntax operates through three segments: Affinity Data™, Syntax Direct™, and Syntax Indices™. Using its patented FIS® technology inspired by systems sciences, the Affinity Data™ segment offers the most comprehensive, granular, and accurate product line revenue data available on the market. The Syntax Direct™ segment then uses this abundance of data to facilitate the near instantaneous creation and ongoing management of boundless direct indexing solutions and rules-based equity portfolios through a fully automated platform. The Syntax Indices™ segment offers customized and proprietary indices, including core global benchmarks and micro- and macro-thematic, smart beta, defined outcome, and target volatility indices. These indices are foundational for a range of financial products, such as ETFs, UITs, and structured products.</p><p><br></p><p><strong>About the Role</strong></p><p><br></p><p>Syntax’s Software Engineering team is a group of highly motivated people with a passion for technology. As Junior Software Engineer you will be responsible for developing, maintaining and innovating on Syntax’s financial software and data products. You will be tasked with writing optimized, performant code, and be provided opportunities to contribute to the planning and design of our products. Your work will contribute to the development of web applications, data pipelines and third party integrations. You will also provide direct feedback into Syntax’s software engineering process and improve the efficiency of the team.</p><p><br></p><p><strong>Responsibilities will include: </strong></p><p><br></p><ul><li>Designing, enhancing and maintaining large financial databases for use in web applications.</li><li>Developing and maintaining database systems supporting the construction of performant, complex queries.</li><li>Writing well-designed APIs and working with backend services.</li><li>Creating flexible and intuitive client facing JSON APIs for streaming data.</li><li>Implementing dynamic front-end layouts to design specifications.</li><li>Ensuring that mission critical systems and services operate smoothly by triaging and resolving operational issues as part of a team of on-call engineers.</li><li>Collaborating with cross-functional teams to identify and solve complex problems.</li></ul><p><br></p><p><strong>Requirements: </strong></p><p><br></p><ul><li>A bachelor’s degree or higher in computer science or related discipline.</li><li>Proficiency in relational database systems such as Postgresql.</li><li>Familiarity with JavaScript and at least one modern front-end framework.</li><li>An eye for code quality, familiarity with design patterns and best practices.</li><li>Excellent problem-solving skills and the ability to work independently and collaboratively in a fast-paced, agile environment.</li><li>Strong communication skills and the ability to effectively articulate technical concepts to both technical and non-technical audiences.</li></ul><p><br></p><p><strong>Preferred Skills:</strong></p><p><br></p><ul><li>Experience working in Finance or Financial Technology (FinTech).</li><li>Prior professional experience working with and deploying to cloud environments such as AWS, DigitalOcean, or equivalent.</li><li>Background in financial services.</li><li>Experience with Ruby on Rails or similar MVC framework.</li><li>Familiarity with Infrastructure as Code and tooling such as Terraform or AWS CDK.</li></ul><p><br></p>\n        </div>"], "company_link": "https://www.linkedin.com/company/syntaxllc?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "information technology and engineering", "industries": "financial services"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-at-outerbounds-3974955802?position=36&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=bO8AdMnMqM0mlYN%2Bx0eGZg%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer", "company_name": "Outerbounds", "job_location": "United States", "job_posted": "20 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          We are building Metaflow (which we started at Netflix) - an open-source, human-centric ML framework that helps data scientists and ML engineers develop and deliver real-life ML projects. Besides Netflix, thousands of enterprises like 23&amp;Me, Adobe, Amazon, Goldman Sachs, Porsche, Sanofi, and Zipline have already adopted Metaflow.<br><br>In this role, you will help us develop our product that helps enterprises to adopt and benefit from Metaflow. This is a great opportunity for senior engineers who value thoughtful product design.<br><br><strong>What We Are Looking For<br><br></strong><ul><li>Years of experience in contributing to non-trivial infrastructure projects. </li><li>Understand how Unix-like operating systems work internally. </li><li>Understand the performance characteristics of computers in general: How to make things slow vs. fast. <br><br></li></ul><strong>What To Expect<br><br></strong><ul><li>Meaningful Work: Your team directly enables and accelerates the innovation of data science, machine learning, and artificial intelligence. </li><li>Impact: You will shape the future of an industry. </li><li>Freedom &amp; Responsibility: Our roles are not circumscribed, so we have the freedom to use our judgment to make Outerbounds better without permission. </li><li>Inclusivity: We embrace different backgrounds, perspectives, and styles because it helps us make better decisions. </li><li>Stunning Colleagues &amp; Top-of-Market Compensation: You will be part of a high-performance team. <br><br></li></ul>We encourage people from all backgrounds to apply. We are well-funded and backed by top-tier venture capital firms, including Greenoaks Capital, Foundation Capital, and Amplify Partners.<br><br>The expected compensation range for this position is $150k - $250k + equity + benefits. We aim to offer top-of-market compensation for a company of our size and communicate equity amounts at the time of offer issuance.<br><br>If this excites you, we would love to talk to you!<br><br>\n        </div>"], "company_link": "https://www.linkedin.com/company/outerbounds?trk=public_jobs_topcard-org-name", "seniority_level": "mid-senior level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-full-stack-at-avela-3974991045?position=38&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=tRrxY8NHv6GzCZVo%2FNR11Q%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer - Full Stack", "company_name": "Avela", "job_location": "New York, NY", "job_posted": "19 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Avela is a Nobel Prize winning platform for families to navigate their child’s educational journey. Parents can find, apply, register, and pay for school and programs for their children, all from a common application system with saved profiles. Avela also powers backend admissions and operational workflows, making it easy for schools, districts, and educational providers to equitably serve students. We’re like “OpenTable for Education” or “Mindbody for Schools.”<br><br>Role<br><br>You'll have an opportunity to influence the vision of the product and culture we are creating together. Come build something out of nothing with us! We're looking for someone entrepreneurial who is excited to work across the product. We're open to mid-level and senior developers with at least 3 years of full-time professional software development experience (no recent grads right now, sorry).<br><br>Location<br><br>Although Avela is a fully remote company, we are slowing building geographic \"hubs\" to facilitate collaboration. We strongly prefer candidates who are located in or around Boston, New York, or San Francisco. We are also open to candidates willing to relocate to those cities or commute into them frequently. Here's more details: https://avela.org/hubs<br><br><strong>Responsibilities<br><br></strong><ul><li>Develop groundbreaking software</li><li>Design and build delightful front-end user experiences</li><li>Architect a scalable back-end</li><li>Explore product-market opportunities and co-create products with our customers. </li><li>Collaborate on the product roadmap and prioritization of our product backlog</li><li>Offering technical support for our customers. Until we grow our customer success team, we’ll need help from the entire engineering team to support our customers with technical issues<br><br><br></li></ul>Qualifications<br><br><ul><li>3+ years of full time experience building software</li><li>2+ years front-end development experience with modern JS development frameworks (React / Vue / Angular)</li><li>2+ years back-end development experience, relational database modeling</li><li>Testing / CI / CD</li><li>Machine learning experience a plus</li><li>Startup experience a plus</li><li>Enterprise software / B2B experience a plus</li><li>Passion for education, equity, or social impact</li><li>Entrepreneurial spirit and drive</li><li>Growth mindset and desire to constantly improve</li><li>Legal ability to work in the US, based in the USA<br><br><br></li></ul>Product<br><br><ul><li>Our primary product is an application and enrollment management system that we sell directly to schools and districts. The system is made up of Avela Apply (application, offers, waitlists), Avela Match (charter lottery, student assignment), and Avela Enroll (registration and advanced form workflows). We also have a stand-alone school finder (Avela Explore), which was one of our first products and is currently being updated to share a backend with the other three products. </li><li>This is a B2B enterprise product, with complex user roles, data permissioning, security/compliance requirements, and more</li><li>We place an emphasis on equity and accessibility in our product and build all end-user facing tools mobile-first, localized, and WCAG 2.1 AA compliant</li><li>We support both admin users at our educational providers (including schools and districts) and end users (parents, guardians, and caregivers), as well as a range of intermediary roles (e.g. school counselors, registrars, etc). (Students do not use our platform directly.)</li><li>Tech stack includes React + TypeScript, Chakra UI, Hasura &amp; GraphQL, AWS Lambda, AWS Serverless Services (Fargate, Aurora, S3, SNS, etc), AWS RDS w/ PostgreSQL, AWS CDK, AWS CodeBuild, AWS Amplify, etc. (Experience with AWS is required, but otherwise no experience with current tech stack required; in fact, we expect to make changes over time.)<br><br><br></li></ul><strong>Company<br><br></strong>Avela is a Nobel Prize-winning edtech startup building the first platform for families to navigate their child's educational journey and a universal application for PK-12 education, daycare, and enrichment programs, promoting equity and access to education. We’re like “OpenTable for Education” or “Mindbody for Schools.”<br><br>For students and families, this simplifies the process of finding and applying to educational programming. For schools and districts, this streamlines operations and helps increase enrollment (and hence, revenue).<br><br>We sell our application and enrollment platform directly to school districts, charter networks, other educational providers, cities, and states. We work with school districts and charter networks across the country, including in Oakland, Seattle, Hartford, Tulsa, New Orleans, Newark, and Jersey City. We also work with a range of nonprofits and NGOs, including Teach for America and the Inter-American Development Bank, as well as the US Military.<br><br>Our platform has four parts to cover each stage of the application journey, from exploring options to applying and final selection and admission:<br><br>Avela Explore - Mobile-optimized school finder and opportunity navigator<br><br>Avela Apply - Streamlined application management system and tracking<br><br>Avela Match - Research-based admission and student assignment lottery system.<br><br>Avela Enroll - Online registration, transfers, and enrollment platform with document collection.<br><br>We also offer a range of consulting services to help districts implement enrollment reforms and advance equity in educational programs.<br><br>Learn more at avela.org.<br><br>Team<br><br>Avela was founded by a renowned team of visionaries, including Nobel Laureate Joshua Angrist, Clark Medalist Parag Pathak, and social entrepreneur Greg Bybee. We have a passionate team of entrepreneurs, engineers, economists, and data scientists - get to know us at https://avela.org/team.<br><br><strong>Benefits<br><br></strong>We love our team and care about their wellness. We strive to offer the best benefits of our peers, including:<br><br><ul><li> Significant equity</li><li> Flexible work policies</li><li> Unlimited vacation</li><li> Home office stipend or WeWork membership</li><li> 401(k) program</li><li> Flexible Savings Account (FSA)</li><li> Dependent Care Saving Plan (DCFSA)</li><li> Commuter Benefits</li><li> Life Insurance by Guardian (covered 100%)</li><li> Platinum Medical Plan by UnitedHealthcare (Employees 100%, Dependents 40%)</li><li> Platinum Dental Plan by Guardian Health (Employees 100%, Dependents 40%)</li><li> Platinum Vision Plan by Guardian Health (Employees 100%, Dependents 40%)<br><br><br></li></ul>Learn more at avela.org/careers.<br><br>Location<br><br>We are a flexible, fully remote company, however all full time employees must live in the United States and meet the work authorization policies below. We are building geographic \"hubs\" to facilitate collaboration, so prefer candidates who are located in/around Boston, New York, Los Angeles, or San Francisco, or are willing to commute into them for monthly on-sites.<br><br>Colleagues are expected to work from a quiet location with reliable, high speed internet, during continental US hours, and in accordance with our collaboration norms outlined below.<br><br>Work Authorization<br><br>Although we are strongly supportive of immigrants and individuals of all backgrounds, unfortunately, as a small startup, we are not in a position to sponsor visas and are only able to consider candidates who are authorized to work in the United States without employer sponsorship. We apologize for the inconvenience and look forward to working together in the future.<br><br>Remote Working and Collaboration Norms<br><br>As a remote-first company, we think deeply about aligning on shared values and collaboration norms. We trust our team and empower everyone to find the right balance for their productivity, but also seek to facilitate synchronous collaboration and minimize asynchronous latency.<br><br>We ask everyone to have access to a quiet environment, free from distractions during working hours with high speed broadband internet. (One of our benefits is that we'll cover a WeWork membership!) Our default is video-on for meetings to foster relationships and allow non-verbal communication cues to come through, however we understand that from time-to-time it’s helpful to turn video off. We also ask colleagues to have a proper office setup with desk, external monitor, quality webcam, etc. (Another benefit is that we cover up to $2,000 of office setup.)<br><br>For full time roles, we expect colleagues to work a normal business day in a continental US timezone of their choice, so long as there's overlap from 12pm - 6pm ET. This ensures sufficient time for synchronous collaboration, but also facilitates flexibility in your schedule. (We are open to other working arrangements, but this must be approved in advance before joining.) We also expect full time employees to join for biannual week-long team offsites (we cover the costs, of course).<br><br>We Encourage You To Apply<br><br>Avela is a safe, inclusive workplace for people of all backgrounds and walks of life. We strongly encourage you to apply if you are from a marginalized or underrepresented group, even if you don't meet all of the job requirements. If you believe this is a role that you’ll be excited to work in every day, want to be a part of a culture like ours, and will be relentless about pushing boundaries to succeed, please apply.<br><br>Tech Stack (for Product/Engineering Roles):<br><br>Experience with our specific technologies is not required, even for engineering roles, and our stack is constantly evolving. Here's what we're using now:<br><br>Front-end:<br><br><ul><li> React + TypeScript</li><li> Chakra UI with focus on a11y</li><li> Jest + React Testing Library for unit tests</li><li> Playwright for end-to-end tests<br><br><br></li></ul>Back-end + Database:<br><br><ul><li> GraphQL with Hasura</li><li> AWS Lambda with NodeJS / TypeScript and Go</li><li> AWS Serverless Services: Fargate, Aurora, S3, SNS</li><li> AWS RDS with PostgreSQL<br><br><br></li></ul>DevOps:<br><br><ul><li> AWS CDK for Infrastructure as Code</li><li> AWS CodeBuild and AWS Codepipeline</li><li> AWS Amplify for Front-End<br><br><br></li></ul>\n        </div>"], "company_link": "https://www.linkedin.com/company/avela?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "education administration programs"},
{"job_link": "https://www.linkedin.com/jobs/view/frontend-software-engineer-at-jellyfish-3945614794?position=32&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=brU9bnXJYlk9siflC7iiUA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Frontend Software Engineer", "company_name": "Jellyfish", "job_location": "United States", "job_posted": "8 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          The team at Jellyfish is changing how product development happens, helping engineering teams learn how to work together and communicate more effectively. We’re in search of a front-end engineer who’s passionate about improving the user experience, learning from customers, and delivering high-quality code to make it happen. Ideally, you’ve worked on a SaaS product in the past using React and are as comfortable working in partnership with product and design on feature discovery as you are putting together the ideas into code. This is a great opportunity to be a member of an exceptional engineering organization with high agency: where you can help shape the features your team builds and how your team builds them.<br><br>If this sounds exciting, we’d love to hear from you.<br><br><strong>What You’ll Do<br><br></strong><ul><li>Develop beautiful, robust user interfaces using React, TypeScript, and Ant Design components</li><li>Be eager to experiment, iterate, and learn quickly as we build out our newest product</li><li>Design, plan, and implement key features as part of a highly effective team</li><li>Parse, understand, and if desired, participate in customer research and discovery to make better and more informed product and technical decisions </li><li>Communicate effectively about project status, technical issues, and breaking down work</li><li>Engage in your team’s processes and work to continually improve your team’s capabilities</li><li>Provide technical and product expertise within your team and across the organization</li><li>Actively participate in a culture supportive of growth and inclusion on your team<br><br></li></ul><strong>About You<br><br></strong><ul><li>Strong programming experience with expertise in at least one web framework, and are open-minded and excited to learn new ones</li><li>Worked collaboratively with product and design partners, proposing technical solutions that help us move with speed and quality</li><li>Strategic about when and how to write tests for your code</li><li>Strong communication skills, and enjoy working as part of a team</li><li>Located in EST or CST time zone<br><br></li></ul><strong>Bonus Points If<br><br></strong><ul><li>Experience building visualizations for applications that ingest, process, and analyze large amounts of data</li><li>You can contribute in areas of the stack besides the front end, or have interest in building some capabilities there</li><li>Previous experience in a fast-changing startup before and loved it<br><br></li></ul>A list of job experiences and qualification requirements is great, but humility, a performance-driven attitude, and a team-player approach are most important to us. We love to have fun and win in the process. We only hire people who have a passion for building great companies in an environment where a sense of humor is a must.<br><br>Applicants must be authorized to work for any employer in the US. We are unable to sponsor or take over sponsorship of an employment Visa at this time.<br><br><strong>Let’s talk about us!<br><br></strong>This is all about you, but you want to know a little about us. Jellyfish was started in 2017 as a team of three with one big idea: engineering is the core of modern business, so let’s create and manage it that way! With the help of our customers, we have built the first Engineering Management Platform, providing visibility into engineering organizations, their work, and how they operate. We enable leaders to align engineering decisions with business initiatives and deliver the right software efficiently and on time.\n        </div>"], "company_link": "https://www.linkedin.com/company/jellyfish-co?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-rider-at-lyft-3934484382?position=1&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=ivWl6xCI%2Fm9zq6t0BSZpYQ%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer, Rider", "company_name": "Lyft", "job_location": "New York, NY", "job_posted": "8 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          At Lyft, our mission is to improve people’s lives with the world’s best transportation. To accomplish this, we start with our own community by creating an open, inclusive, and diverse organization.<br><br>Lyft is looking for software engineers from a scope of disciplines. We are growing our team with people who want to build, improve and incorporate technologies that make the lives of our community more enriched. As an engineer at Lyft, you'll collaborate with teams like product, data science, analytics, and operations on code that empower us to iterate quickly, while focusing on delighting our passengers and drivers.<br><br>The Rider organization is focused on building a seamless, best-in-class rideshare experience for riders. From the foundational functionality of requesting a ride to the tailored interactions with your flight, we sweat the small stuff to help make Lyft the best transportation solution. As a Software Engineer on the Rider Team, you will work hand in hand with various teams across Lyft, fostering collaboration, and driving innovation to improve riders' experience with rideshare.<br><br>Responsibilities:<br><br><ul><li>Write well-crafted, well-tested, readable, maintainable code</li><li>Participate in code reviews to ensure code quality and distribute knowledge </li><li>Participate in our teams oncall rotation. Identify, triage, debug and resolve issues/bugs across our various applications and platforms</li><li>Have the ability to explain the various trade offs made in decisions</li><li>Manage project priorities, deadlines, and deliverables.<br><br></li></ul>Experience:<br><br><ul><li>BS/MS or equivalent in Computer Engineering, Computer Science, or related field or equivalent practical experience</li><li>Experience with Python, Go.</li><li>Proficiency in object-oriented programming</li><li>Experience working with data structures or algorithms </li><li>Ability to work with a low-ego, highly collaborative, and cross-functional team</li><li>Bonus points: experience pursuing side projects or open-source projects<br><br></li></ul><strong>Benefits:<br><br></strong><ul><li>Great medical, dental, and vision insurance options</li><li>Mental health benefits</li><li>Family building benefits</li><li>In addition to 12 observed holidays, salaried team members have unlimited paid time off, hourly team members have 15 days paid time off</li><li>401(k) plan to help save for your future</li><li>18 weeks of paid parental leave. Biological, adoptive, and foster parents are all eligible</li><li>Pre-tax commuter benefits</li><li>Lyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership Program<br><br></li></ul><em>Lyft is an equal opportunity/affirmative action employer committed to an inclusive and diverse workplace. All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law. <br><br></em><em>This role will be in-office on a hybrid schedule — Team Members will be expected to work in the office 3 days per week on Mondays, Thursdays and a team-specific third day. Additionally, hybrid roles have the flexibility to work from anywhere for up to 4 weeks per year.<br><br></em><em>The expected range of pay for this position in New York is $117,000 - $130,000. Salary ranges are dependent on a variety of factors, including qualifications, experience and geographic location. Range is not inclusive of potential equity offering, bonus or benefits. Your recruiter can share more information about the salary range specific to your working location and other factors during the hiring process.</em>\n        </div>"], "company_link": "https://www.linkedin.com/company/lyft?trk=public_jobs_topcard-org-name", "seniority_level": "mid-senior level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "ground passenger transportation"},
{"job_link": "https://www.linkedin.com/jobs/view/junior-javascript-developer-at-patterned-learning-career-3975574196?position=28&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=zhN5DZcJDsiURQEgJ1vDxw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Junior JavaScript Developer", "company_name": "Patterned Learning Career", "job_location": "San Antonio, TX", "job_posted": "4 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong>Junior JavaScript Developer - Remote Job, 1+ Year Experience<br><br></strong><strong>Annual Income:</strong> $68K - $78K<br><br><strong>A valid work permit is necessary in the US<br><br></strong><strong>About us:</strong> Patterned Learning is a platform that aims to help developers code faster and more efficiently. It offers features such as collaborative coding, real-time multiplayer editing, and the ability to build, test, and deploy directly from the browser. The platform also provides tightly integrated code generation, editing, and output capabilities.<br><br>Description:<br><br>As a JavaScript Developer, you will be responsible for developing and implementing web applications, user interfaces, and other interactive elements using JavaScript, HTML, and CSS. You will collaborate with cross-functional teams to understand project requirements, design innovative solutions, and deliver high-quality code.<br><br>Responsibilities:<br><br><ul><li>Develop interactive web applications using JavaScript, HTML, and CSS. </li><li>Collaborate with designers and product managers to implement user interfaces that are visually appealing and intuitive. </li><li>Write clean, efficient, and reusable code. </li><li>Ensure the technical feasibility of UI/UX designs. </li><li>Optimize applications for maximum speed and scalability. </li><li>Collaborate with back-end developers to integrate front-end and back-end functionalities. </li><li>Stay up-to-date with the latest industry trends and best practices in JavaScript development. <br><br></li></ul>Requirements:<br><br><ul><li>Bachelor's degree in Computer Science, Software Engineering, or a related field. </li><li>Proven work experience as a JavaScript Developer or Front-End Developer. </li><li>Strong proficiency in JavaScript, HTML, and CSS. </li><li>Experience with modern JavaScript frameworks such as React, Angular, or Vue.js. </li><li>Familiarity with server-side technologies such as Node.js. </li><li>Knowledge of responsive design and mobile-first development. </li><li>Understanding of cross-browser compatibility issues and ways to work around them. </li><li>Excellent problem-solving skills and attention to detail. </li><li>Strong communication and collaboration abilities. </li><li>Ability to work effectively in a fast-paced, deadline-driven environment. </li><li>A portfolio of past projects or code samples will be highly advantageous. <br><br></li></ul><strong>Why Patterned Learning LLC?<br><br></strong>Patterned Learning can provide intelligent suggestions, automate repetitive tasks, and assist developers in writing code more effectively. This can help reduce coding errors, improve productivity, and accelerate the development process.<br><br>Pattern recognition is particularly relevant in the context of coding. Neural networks, especially deep learning models, are commonly employed for pattern detection and classification tasks. These models simulate human decision-making and can identify patterns in data, making them well-suited for tasks like code analysis and generation.<br><br>\n        </div>"], "company_link": "https://www.linkedin.com/company/patterned-learning-career?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "information technology", "industries": "it services and it consulting"},
{"job_link": "https://www.linkedin.com/jobs/view/full-stack-developer-at-eccalon-llc-3975409367?position=31&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=vsvGkNKe7OuAuwU56b1i%2Fg%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Full Stack Developer", "company_name": "Eccalon, LLC", "job_location": "Hanover, MD", "job_posted": "19 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Location: Remote<br><br></strong><strong>Job Summary<br><br></strong>Eccalon is seeking a talented Full Stack Developer to join our dynamic IT team. As a Full Stack Developer, you will be responsible for designing, developing, and implementing software solutions across both front-end and back-end technologies. You will collaborate with cross-functional teams to define, design, and ship new features, and iterate on existing products.<br><br><strong>Key Responsibilities<br><br></strong><ul><li>Designing, developing, and maintaining both front-end and back-end web applications.</li><li>Developing front-end architecture using modern JavaScript frameworks (e.g., React, Angular, Vue.js).</li><li>Building reusable components and front-end libraries for future use.</li><li>Translating designs and wireframes into high-quality code.</li><li>Developing and implementing back-end services and APIs using Node.js, Python, Ruby, or other server-side languages.</li><li>Integrating front-end and back-end aspects of the web application.</li><li>Ensuring cross-platform optimization for mobile devices.</li><li>Implementing responsive design principles to ensure that applications render well across multiple devices.</li><li>Writing clean, scalable, and well-documented code.</li><li>Conducting code reviews and providing constructive feedback to peers.</li><li>Troubleshooting and debugging applications.</li><li>Managing and maintaining databases (SQL and NoSQL) and data storage solutions.</li><li>Implementing security and data protection measures.</li><li>Collaborating with UX/UI designers, product managers, and stakeholders to ensure technical feasibility of UI/UX designs.</li><li>Keeping abreast of industry trends and best practices in software development.<br><br></li></ul><strong>Required Qualifications<br><br></strong><ul><li>Bachelor’s degree in Computer Science, or a related field (or equivalent work experience).</li><li>Proven experience as a Full Stack Developer or similar role.</li><li>Strong proficiency in front-end technologies such as HTML5, CSS3, JavaScript (ES6+), and one or more modern JavaScript frameworks (React, Angular, Vue.js).</li><li>Experience with server-side languages such as Node.js, Python, etc.</li><li>Experience with back-end frameworks such as Express.js, Nextjs, etc.</li><li>Experience with databases (e.g., MySQL, PostgreSQL, MongoDB).</li><li>Familiarity with RESTful APIs and microservices architecture.</li><li>Knowledge of code versioning tools (e.g., Git, SVN).</li><li>Understanding of CI/CD pipelines and DevOps practices.</li><li>Excellent problem-solving skills and attention to detail.</li><li>Good interpersonal and communication skills.</li><li>Ability to work effectively in a collaborative team environment.</li></ul>\n        </div>"], "company_link": "https://www.linkedin.com/company/eccalon?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "defense and space manufacturing"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-at-microsoft-3974335499?position=34&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=Kon%2FEXY0yi4ACzwmmZKs5Q%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer", "company_name": "Microsoft", "job_location": "Redmond, WA", "job_posted": "", "exact_date": "", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Microsoft is looking for a Software Engineer. SONiC team owns all the software that is running on the switches and routers. We have lots of interesting problems to solve, such as supporting new generation switches ranging from 10G/40G to 100G/400G/800G, adding packet forwarding features, providing extensive telemetry data for the switches, and designing features for smartswitch. The SW team works on all the stages of network switches, from defining new switch requirements, to hardware/software design, getting the latest Linux kernel for our switch platforms and supporting them in operations. The team is also building vibrant open-source community for the switch software, which is adopted by various other cloud providers.<br><br>Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.<br><br><strong>Responsibilities<br><br></strong><ul><li>Design and implement platform services such as programming, monitoring, and controlling system components like the transceivers/optics, Smart-cable, PHY, FPGAs, sensors, fan control power etc.</li><li>Design and implement kernel device drivers and platform services</li><li>Own workstreams focused on hardware bringup, port bringup, platform services bringup, and lead the cross-functional effort for validation of new switches</li><li>Debugging and analyze/profile performance problems</li><li>Debug complex, system-level, multi-component issues that typically span across multiple layers from Kernel, and user-mode applications</li><li>Develop robust unit test framework to test newly added functionality or hardware capability</li><li>Work with network engineers to support Azure production network</li><li>Other</li><ul><li>Embody our Culture and Values<br></li></ul></ul><strong>Qualifications<br><br></strong>Required Qualifications:<br><br><ul><li>Bachelor's Degree in Computer Science, Electric Engineering, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><ul><li>OR equivalent experience<br></li></ul></ul><strong>Other Requirements<br><br></strong><ul><li>Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: </li><ul><li>Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.<br></li></ul></ul><strong>Preferred Qualifications<br><br></strong><ul><li>Experience delivering commercial software</li><li>Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><ul><li>OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><li>OR equivalent experience.<br></li></ul></ul>Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.<br><br>Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay<br><br>Microsoft will accept applications for the role until August 11, 2024.<br><br>#azurecorejobs<br><br>Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        </div>"], "company_link": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/web-developer-at-athlete-to-athlete-3974991174?position=27&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=MAKATG9EU0hWig0zJYw2ng%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Web Developer", "company_name": "Athlete To Athlete", "job_location": "Los Angeles, CA", "job_posted": "19 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>About Athlete To Athlete<br><br></strong>Athlete to Athlete is a fast-growing, venture-backed start-up based in Los Angeles that offers Athletic Mentorship and Coaching Programs for youth athletes. In our programs, student-athletes are paired with a current Division 1 College-Athlete Mentor who plays their sport and can help build their confidence, taking their game to the next level. Our mission is to build the next generation of driven, confident, and resilient student-athletes through mentorship.<br><br><strong>About The Job<br><br></strong>We are seeking a talented Web Developer to join our team. As a Web Developer at Athlete To Athlete, you will play a key role in enhancing our digital presence, improving user experiences, and integrating backend functionalities with our Sales and Platform databases. This is an on-site position based in Los Angeles.<br><br><strong>Requirements<br><br></strong><ul><li>Bachelor's degree in Computer Science, Engineering, or a related field, or equivalent practical experience</li><li>Proven experience as a Web Developer or similar role, preferably in a startup environment</li><li>Proficiency in front-end technologies: HTML5, CSS3, JavaScript (including ES6+), and frameworks like React, Angular, or Vue</li><li>Strong understanding of server-side languages such as Node.js, Next.js, Python, or Ruby, and related frameworks like Express, Django, or Ruby on Rails</li><li>Experience with relational databases (e.g., MySQL, PostgreSQL) and NoSQL databases (e.g., MongoDB)</li><li>Familiarity with RESTful APIs, GraphQL, and integrating third-party services</li><li>Proficiency in version control systems (e.g., Git) and CI/CD pipelines</li><li>Ability to work collaboratively in a fast-paced environment and contribute effectively to team goals</li><li>Strong problem-solving skills and attention to detail<br><br><br></li></ul>Responsibilities<br><br><ul><li>Collaborate with designers and product managers to implement UI/UX designs into responsive web applications</li><li>Develop and maintain front-end and back-end features for Athlete To Athlete's website and landing pages</li><li>Implement secure and scalable integrations between web applications and Sales/Platform databases</li><li>Ensure compatibility across browsers and optimize web application performance</li><li>Participate in code reviews, architectural discussions, and issue troubleshooting</li><li>Stay informed about emerging technologies and propose innovative solutions for continuous improvement<br><br><br></li></ul>Nice to Have<br><br><ul><li>Experience with cloud services (e.g., AWS, Google Cloud) and serverless architectures</li><li>Knowledge of UI/UX design principles and wireframing tools</li><li>Previous involvement with sports, fitness, or community-driven platforms</li><li>Join Athlete To Athlete and contribute to shaping the future of sports technology. This is an exciting opportunity to be part of a passionate team dedicated to empowering athletes globally. If you thrive in a startup environment and are eager to make a difference, we encourage you to apply<br><br><br></li></ul>Benefits<br><br><ul><li>Competitive salary and equity options</li><li>Flexible work hours and remote work opportunities</li><li>Health insurance and wellness programs</li><li>Professional development budget</li><li>Team outings and social events<br><br><br></li></ul>Athlete to Athlete is an equal opportunity employer. All applicants will be considered for employment regardless of race, color, national origin, religion, sex, age, disability, sexual orientation, gender identity, veteran or disability status.\n        </div>"], "company_link": "https://www.linkedin.com/company/athlete-to-athlete?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "sports and recreation instruction"},
{"job_link": "https://www.linkedin.com/jobs/view/frontend-developer-at-mary-kay-global-3862519592?position=26&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=d5VJCAr4AgmUn0q9t%2BpfoA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Frontend Developer", "company_name": "Mary Kay Global", "job_location": "Dallas-Fort Worth Metroplex", "job_posted": "20 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>We are seeking a talented Frontend Developer with a strong focus on accessibility and a proven track record in developing WCAG 2.2 AA compliant applications. The ideal candidate will be proficient in HTML, CSS, JavaScript, Web Components, and/or building Lightning Web Components working on <strong>Salesforce Experience Cloud/Lightning Web Runtime projects</strong>. You will be responsible for ensuring our applications are not only visually appealing and user-friendly but also accessible to users of all abilities.</p><p><br></p><p>Key Responsibilities:</p><p>- Develop, test, and maintain responsive web applications with a strong emphasis on accessibility and user experience.</p><p>- Implement and adhere to WCAG 2.2 AA guidelines to ensure all web applications are accessible.</p><p>- Utilize HTML, CSS, JavaScript, and Lightning Web Components to create dynamic and interactive user interfaces.</p><p>- Collaborate with UX/UI designers to translate designs into functional and accessible front-end code.</p><p>- Conduct accessibility audits and usability testing to identify and address accessibility issues.</p><p>- Optimize applications for maximum speed and scalability.</p><p>- Provide expertise and guidance on accessibility standards and best practices to the development team.</p><p>- Work on Salesforce Experience Cloud projects, ensuring seamless integration and enhanced user experiences.</p><p><br></p><p>Required Qualifications:</p><p>- Proven experience as a Frontend Developer with a focus on accessibility and responsive design.</p><p>- In-depth knowledge of WCAG 2.2 AA guidelines and best practices.</p><p>- Proficiency in HTML, CSS, JavaScript, and Web Components/Lightning Web Components.</p><p>- Experience with accessibility tools and technologies such as screen readers, ARIA, and keyboard navigation.</p><p>- Strong understanding of cross-browser compatibility issues and ways to work around them.</p><p>- Familiarity with version control systems such as Git.</p><p>- Excellent problem-solving skills and attention to detail.</p><p>- Strong communication and collaboration skills.</p><p><br></p><p>Preferred Qualifications:</p><p>- Experience working on Salesforce Experience Cloud projects.</p><p>- Knowledge of modern front-end frameworks and libraries (e.g., <strong>React, Angular, Vue.js</strong>).</p><p>- Understanding of server-side CSS pre-processing platforms, such as SASS.</p><p>- Familiarity with Agile development methodologies.</p><p>- Experience with automated testing frameworks and tools.</p>\n        </div>"], "company_link": "https://www.linkedin.com/company/marykayglobal?trk=public_jobs_topcard-org-name", "seniority_level": "associate", "employment_type": "full-time", "job_function": "information technology", "industries": "personal care product manufacturing, technology, information and media, and pharmaceutical manufacturing"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-at-microsoft-3974964456?position=25&pageNum=0&refId=2LMV%2Fa%2BL0Cn38C9wYdFJGg%3D%3D&trackingId=J%2B5keMuuavnTAuf1eUiq2A%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer", "company_name": "Microsoft", "job_location": "Atlanta, GA", "job_posted": "20 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Microsoft Cloud for Industry (MCI) is a key part of Microsoft’s mission to empower every person and every organization on the planet to achieve more. MCI's role within this growth strategy is to enable partners and foster the development of industry capabilities to grow our key horizontal services and solutions. We stay laser focused on driving Microsoft (MSFT) Cloud adoption and usage through driving engagement with prioritized industry partners. Our partners desire for a simple, easy &amp; intuitive path to develop and deploy their well architected industry solutions on top of the Microsoft Cloud. This in addition to providing diversity of cutting-edge platforms and services also allows our partners to ship and support their solutions to their end customers with solid fundamentals - security, privacy, compliance; the same way MSFT core services do.<br><br>Here is your opportunity to join the Microsoft Cloud for Independent Software Vendors (ISV) team. We are establishing a new engineering team focused on building and shipping cross Cloud framework components and driving in-depth engagements with ISVs. There is a huge opportunity to stay focused and work closely with Azure, D365 and M365 organizations and make our ISV’s end to end journey (Plan, Build, Deploy and Manage) successful on the Microsoft Cloud.<br><br>You will be working collaboratively with the team to deliver required features, drive resolutions to complex customer reported issues that span across multiple services, work through priorities, solve complex technical challenges to meet business goals, and maintain live site availability. You will also get opportunities to demonstrate end to end ownership of features with quality first mindset and collaborate across diverse teams of engineers, program managers, and UX designers.<br><br>We are looking for a motivated Software Engineer that is passionate about making our ISVs successful on the Microsoft Cloud and desires to join a newly formed team with immense growth opportunities!<br><br>Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.<br><br><strong>Responsibilities<br><br></strong><ul><li>Partner with engineering teams across Azure.</li><li>Research, architect, co-develop and deliver solutions in an agile development environment.</li><li>Conduct extensive development and unit testing.</li><li>Solve manual issues through automation and tooling improvements.</li><li>Experience using data to drive prioritization and measure progress</li><li>Effectively leverage data to guide analysis and decision making<br><br></li></ul>Embody our Culture and Values<br><br><strong>Qualifications<br><br></strong><strong>Required/</strong><strong>Minimum</strong><strong> Qualifications <br><br></strong><ul><li><ul><li>Bachelor's Degree in Computer Science, or related technical discipline with proven work experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><ul><li>OR equivalent experience.<br></li></ul></ul></ul><strong>Preferred/Additional Qualifications<br><br></strong><ul><li><ul><li>Experience designing, developing, and operating large-scale internet-scale services</li><li>Ability to debug and optimize code, and automate routine tasks<br></li></ul></ul>Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.<br><br>Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:<br><br>https://careers.microsoft.com/us/en/us-corporate-pay<br><br>Microsoft will accept applications for the role until July 26, 2024.<br><br>#MCI<br><br>Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        </div>"], "company_link": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/back-end-developer-at-dataannotation-3901374617?position=10&pageNum=97&refId=9%2F5LKhwHWqVcl2fGjNCA1g%3D%3D&trackingId=ArXHeqotFO0o%2FIk6rUa%2Bkw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Back End Developer", "company_name": "DataAnnotation", "job_location": "Greater Tampa Bay Area", "job_posted": "", "exact_date": "", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.</p><p><br></p><p>We are looking for a proficient Back End Developer to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.</p><p><br></p><p>In this role you will need to be proficient in at least one programming language (Python, JavaScript, HTML, C++, C#, Swift and SQL) and able to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.</p><p><br></p><p>Benefits:</p><p><br></p><ul><li>This is a full-time or part-time REMOTE position</li><li>You’ll be able to choose which projects you want to work on</li><li>You can work on your own schedule</li><li>Projects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume work</li></ul><p><br></p><p>Responsibilities:</p><p><br></p><ul><li>Come up with diverse problems and solutions for a coding chatbot</li><li>Write high-quality answers and code snippets</li><li>Evaluate code quality produced by AI models for correctness and performance</li></ul><p><br></p><p>Qualifications:</p><p><br></p><ul><li>Fluency in English (native or bilingual level)</li><li>Proficient in at least one programming language (Python, JavaScript, HTML, C++, C#, Swift and SQL)</li><li>Excellent writing and grammar skills</li><li>A bachelor's degree (completed or in progress)</li></ul><p><br></p><p>Note: Data Annotation payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD.</p>\n        </div>"], "company_link": "https://www.linkedin.com/company/dataannotationtech?trk=public_jobs_topcard-org-name", "seniority_level": "not applicable", "employment_type": "contract", "job_function": "engineering, research, and analyst", "industries": "software development, computer and network security, and engineering services"},
{"job_link": "https://www.linkedin.com/jobs/view/java-developer-remote-at-synergisticit-3975526975?position=9&pageNum=97&refId=9%2F5LKhwHWqVcl2fGjNCA1g%3D%3D&trackingId=KyCHwvkl3xAlzopDArcafw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Java Developer - Remote", "company_name": "SynergisticIT", "job_location": "Indianapolis, IN", "job_posted": "10 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Since 2010 Synergisticit has helped Jobseekers get employed in the tech Job market by providing candidates the requisite skills, experience, and technical competence to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a tech Job we make careers.<br><br><strong> In this Job market also, our candidates can achieve multiple job offers and $100k + salaries. <br><br></strong><strong> please check the below links to see the success outcomes and salaries of our candidates </strong>.<br><br><strong> https://www.synergisticit.com/candidate-outcomes/ <br><br></strong>https://reg.rf.oracle.com/flow/oracle/cwoh23/OCWExhibitorCatalog/page/OCWexhibitorcatalog<br><br><strong> We regularly interact with the Top Tech companies to give our candidates a competitive advantage visit the below videos exhibiting at Oracle Cloud World/Oracle Java One (Las Vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023 <br><br></strong><strong> https://synergisticit.wistia.com/medias/tmwjwchxz5 <br><br></strong><strong> https://synergisticit.wistia.com/medias/n8487768di <br><br></strong><strong> https://synergisticit.wistia.com/medias/o5gmv7i9eu <br><br></strong><strong> https://synergisticit.wistia.com/medias/k6t6a1n4kb <br><br></strong><strong> https://synergisticit.wistia.com/medias/pgrvq4fgni <br><br></strong><strong> https://synergisticit.wistia.com/medias/ce4syhm853 <br><br></strong>All Positions are open for all visas and US citizens<br><br>We at Synergistic understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like <strong> Apple, google, Paypal, Western Union, Client, visa, Walmart lab </strong>s etc to name a few.<br><br>Currently, We are looking for <strong> entry-level software programmers, Java full-stack developers, Python/Java developers, Data analysts/ Data Scientists, and Machine Learning engineers </strong> for full-time positions with clients.<br><br>Who Should Apply Recent Computer Science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and are looking to make their careers in the Tech Industry.<br><br><strong> We assist in filing for STEM extension and also for H1b and Green card filing to Candidates <br><br></strong><strong> We want Data Science/Machine learning/Data Analyst and Java Full stack candidates <br><br></strong><strong> For data Science/Machine learning Positions <br><br></strong><strong>Required Skills<br><br></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br><br>Project work on the technologies needed<br><br>Highly motivated, self-learner, and technically inquisitive<br><br>Experience in programming language Java and understanding of the software development life cycle<br><br>Knowledge of Statistics, Gen AI, LLM, Python, Computer Vision, data visualization tools<br><br>Excellent written and verbal communication skills<br><br><strong> Preferred skills: NLP, Text mining, Tableau, PowerBI, Databricks, Tensorflow <br><br></strong><strong>Required Skills<br><br></strong><strong> REQUIRED SKILLS For Java /Full stack/Software Positions <br><br></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br><br>Highly motivated, self-learner, and technically inquisitive<br><br>Experience in programming language Java and understanding of the software development life cycle<br><br>Project work on the skills<br><br>Knowledge of Core Java, Javascript, C++, or software programming<br><br>Spring boot, Microservices, Docker, Jenkins, Github, Kubernetes, and REST API experience<br><br>Excellent written and verbal communication skills<br><br><strong> If you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team and only connect with candidates who match client requirements. <br><br></strong><strong> No phone calls, please. </strong> Shortlisted candidates would be reached out. No third-party or agency candidates or C2C candidates\n        </div>"], "company_link": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "contract", "job_function": "information technology", "industries": "it services and it consulting"},
{"job_link": "https://www.linkedin.com/jobs/view/software-engineer-at-epic-3909189286?position=5&pageNum=97&refId=9%2F5LKhwHWqVcl2fGjNCA1g%3D%3D&trackingId=NrWtJ9d1qZ9oX3cdGCVWBw%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Software Engineer", "company_name": "Epic", "job_location": "Bowie, MD", "job_posted": "8 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Please note that this position is based on our campus in Madison, WI, and requires relocation to the area. We recruit nationally and provide financial relocation assistance.<br><br><strong>Code that saves lives. <br><br></strong>As a software developer at Epic, you’ll write software that impacts the lives of 75% of Americans and 300 million patients around the world. Working in your own office, surrounded by thousands of high-caliber developers, you’ll use modern development methodologies and employ user-centered design, analytics, and machine learning tools to drive innovation in healthcare. Using leading-edge technologies and languages like JS, TS, and C#, you’ll invent better ways to reduce medical errors, streamline record sharing between hospitals, and provide the quality of care a patient deserves.<br><br><strong>Write software for the most innovative health systems on the planet.<br><br></strong>The top-ranked health systems in U.S. News and World Report are Epic customers. Our community includes major systems like the Mayo Clinic, Johns Hopkins, Cleveland Clinic, and Kaiser Permanente, as well as leading academic medical centers at the University of Wisconsin, University of Michigan, University of California, University of Texas, The Ohio State University, and many more.<br><br><strong>Experience our state-of-the-art campus, eat delicious food, and travel the world.<br><br></strong>We don’t believe in cubicles. (Well, we believe they <em>exist</em>, but…) Our uniquely themed campus was designed to heighten your ability to get stuff done in your office, a conference room, or by the fireplace in a comfy chair. For lunch, visit King’s Cross or Cassiopeia for a wide array of meal options, or go to one of our smaller, themed bistros, featuring wood-rotisserie, pan-Asian, and Latin-inspired cuisine. All meals are restaurant-quality but cost only a few dollars, and they’re prepared by a team comprised of kitchen talent from restaurants around the country. And, after five years here, you’ll earn a four-week sabbatical anywhere in the world. Staff have kayaked in Patagonia, attended a Beyoncé concert in Ireland, built a library in Tanzania, and run a marathon in Antarctica.<br><br><strong>Live affordably in a city known for its rising tech talent.<br><br></strong>Epic is located just outside Madison, Wisconsin, which is the second fastest growing market for tech talent in the United States, home to the state capital, and the University of Wisconsin. Madison has received accolades for being the greenest city in America (NerdWallet), the best city for renters (SmartAsset), fittest city in America (Fitbit), and, for the gamers, is one of a handful of US cities to have a Killer Queen arcade game, located at Madison’s first arcade bar.<br><br><strong>More than just important work</strong>.<br><br>We offer comprehensive benefits to keep you healthy and happy as you grow in your life and career, and your merit-based compensation will reflect the impact your work has on the company and our customers. You'll also be eligible for annual raises and bonuses, as well as stock grants, which give you an even greater stake in the success of Epic and our customers. Epic is an Equal Opportunity employer. We seek diverse perspectives, backgrounds, and experiences in our mission to improve healthcare. Research has shown that job-seekers who are women, LGBTQ+, or members of the global majority are less likely to apply for roles they don't seem completely qualified for, so we encourage all who are interested to apply. Please see our full non-discrimination statement at https //careers.epic.com/EEO.<br><br><ul><li>Relocation to Madison, WI area (reimbursed)</li><li>BS/BA or greater in Computer Science, Mathematics, Software Engineering, Computer Engineering, or a related field</li><li>A history of academic excellence or professional success</li><li>Eligible to work in the United States without visa sponsorship (persons with appropriate qualifications and eligible for TN status under NAFTA may apply)</li><li>COVID-19 vaccination</li></ul>\n        </div>"], "company_link": "https://www.linkedin.com/company/epic1979?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "software development"},
{"job_link": "https://www.linkedin.com/jobs/view/senior-frontend-engineer-at-ro-3973753831?position=6&pageNum=97&refId=9%2F5LKhwHWqVcl2fGjNCA1g%3D%3D&trackingId=tLdd1ZsLK3Tl6xKp1zC9dg%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "Senior Frontend Engineer", "company_name": "Ro", "job_location": "New York, NY", "job_posted": "18 hours ago", "exact_date": "2024-07-12", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Who We Are<br><br></strong>Ro is a direct-to-patient healthcare company with a mission of helping as many patients as possible achieve their health goals. Ro is the only company to offer telehealth care, at-home diagnostic testing, labs, and pharmacy services nationwide. This is enabled by Ro's vertically integrated platform that helps patients achieve their goals through a convenient end-to-end healthcare experience spanning from diagnosis, to delivery of medication, to ongoing care. Since 2017, Ro has helped millions of patients in nearly every single county in the United States, including 98% of primary care deserts.<br><br>Ro was recognized as a CNBC Disruptor 50 in 2022, listed by Inc. Magazine as a Best Place to Work in 2022 for our third consecutive year, and named one of FORTUNE's 2022 Best Medium Workplaces.<br><br>As a Senior FE Engineer at Ro, you will play a crucial role in transforming healthcare access through technology. You will collaborate closely with a cross-functional team to develop innovation and use-friendly tools and experiences for providers and patients. Your work will directly impact thousands of patients by creating delightful, intuitive web applications that enhance their healthcare experience. You will be responsible for visual quality and technical excellence in the Ro web apps, active technical contributions to architecting the larger patient and provider experiences, and mentorship of engineers to build more general expertise in best practices for web development, accessibility, and performance.<br><br><strong>What You'll Do<br><br></strong><ul><li>Drive the architecture, design, and implementation of new features in our member experiences and care platform on the web, which support thousands of current members and potential new patients every day.</li><li>Build realtime, visually engaging, intuitive touchpoints that will enable patients to seamlessly achieve their health goals and providers to efficiently and safely provide care.</li><li>Collaborate with engineers cross-functionally as well as the product and design team(s) to influence the roadmap and product development of our patient and provider experiences.</li><li>Identify areas of improvement in application performance and drive best practices for both the app and its upstream and downstream dependencies.</li><li>Ideate on the future of our user experience, using both qualitative user feedback and quantitative analytics and monitoring to help identify areas of opportunity. </li><li>Bring industry learnings in all technologies related to web development (libraries, web APIs, performance, accessibility guidance, etc) to the team to look for opportunities to continue to improve the patient experience.</li><li>Actively participate in all team agile ceremonies, contributing to ensure that all team commitments are delivered on time and of the highest quality.<br><br></li></ul><strong>What You'll Bring To The Team<br><br></strong><ul><li>5+ years building accessible web applications with an eye for intuitive, visually engaging user-facing experiences</li><li>Proficient with React and Typescript, as well as knowledge of UI architecture and performance</li><li>Strong background in server-side rendering and client-side performance optimization</li><li>Demonstrated skills in delivering high quality code that is well-documented and highly maintainable.</li><li>Excellent communication and interpersonal skills, with the ability to work effectively with cross-functional teams and work closely with product designers and product managers.</li><li>Genuine care about the user experience and can quickly assess the right visual solutions to achieve the product and design goals in an elegant manner.</li><li>Passion for continuous learning and innovation in the web/frontend space</li><li>Strong sense of responsibility and ownership for your own work from the initial technical design and implementation all the way to monitoring for issues/opportunities after shipping out a new feature<br><br></li></ul><strong>We've Got You Covered<br><br></strong><ul><li>Full medical, dental, and vision insurance + OneMedical membership</li><li>Healthcare and Dependent Care FSA</li><li>401(k) with company match</li><li>Flexible PTO</li><li>Wellbeing + Learning &amp; Growth reimbursements</li><li>Paid parental leave + Fertility benefits</li><li>Pet insurance</li><li>Student loan refinancing</li><li>Virtual resources for mindfulness, counseling, and fitness<br><br></li></ul>We welcome qualified candidates of all races, creeds, genders, and sexuality to apply.<br><br>The target for this position ranges from $173,800 to $204,500, in addition to a competitive equity and benefits package (as applicable). When determining compensation, we analyze and carefully consider several factors, including location, job-related knowledge, skills and experience. These considerations may cause your compensation to vary.<br><br>Ro recognizes the power of in-person collaboration, while supporting the flexibility to work anywhere in the United States. For our Ro’ers in the tri-state (NY) area, you will join us at HQ on Tuesdays and Thursdays. For those outside of the tri-state area, you will be able to join in-person collaborations throughout the year (i.e., during team on-sites).<br><br>At Ro, we believe that our diverse perspectives are our biggest strengths — and that embracing them will create real change in healthcare. As an equal opportunity employer, we provide equal opportunity in all aspects of employment, including recruiting, hiring, compensation, training and promotion, termination, and any other terms and conditions of employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, familial status, age, disability and/or any other legally protected classification protected by federal, state, or local law.<br><br>See our California Privacy Policy here .\n        </div>"], "company_link": "https://www.linkedin.com/company/ro?trk=public_jobs_topcard-org-name", "seniority_level": "mid-senior level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "it services and it consulting, manufacturing, and wellness and fitness services"},
{"job_link": "https://www.linkedin.com/jobs/view/ai-ml-software-engineer-at-dassault-syst%C3%A8mes-3937091567?position=4&pageNum=97&refId=9%2F5LKhwHWqVcl2fGjNCA1g%3D%3D&trackingId=Gc12p4EC5iuAVduT0pMzOA%3D%3D&trk=public_jobs_jserp-result_search-card", "job_title": "AI/ML Software Engineer", "company_name": "Dassault Systèmes", "job_location": "Waltham, MA", "job_posted": "8 hours ago", "exact_date": "2024-07-13", "description": ["<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Role Description &amp; Responsibilities<br><br></strong><strong>DASSAULT SYSTEMES</strong> <strong>SOLIDWORKS Corp</strong>. offers complete 3D software tools that let you create, simulate, publish, and manage your data. <strong>SOLIDWORKS </strong>products are easy to learn and use, and work together to help you design products better, faster, and more cost-effectively.<br><br>We're in search of a motivated <strong>AI/ML Software Engineer</strong> to join our team in <strong>Waltham, MA</strong>. In this capacity, you'll play a pivotal role as an AI/Machine Learning Software Engineer, bridging AI/ML models with the exceptional functionality of SolidWorks.<br><br><ul><li>Design, develop, and enhance software solutions to deliver world-class apps, services, and technologies, enriching user experiences and value.</li><li>Continuously refine deliveries based on user feedback and usage metrics.</li><li>As a seasoned software engineer, serve as a technical resource to facilitate the development and deployment of new Artificial Intelligence applications within the SolidWorks desktop application.</li><li>Collaborate with a globally distributed team, leading various R&amp;D activities throughout the software development lifecycle, including:</li><ul><li>Conceptualizing technical approaches</li><li>Developing AI/ML models</li><li>Architecting software interfaces between ML models and the application</li><li>Programming</li><li>Testing</li><li>Documentation<br></li></ul></ul><strong>Qualifications:<br><br></strong><ul><li>Bachelor’s Degree in a technical discipline</li><li>2-5+ years of professional development experience</li><li>Proficiency in coding across diverse software development domains (e.g., UX, web, cloud, algorithms, industry processes)</li><li> Hands on working experience or very good academic knowledge of AI/ML concepts, models and algorithms is highly desirable.</li><li>Familiarity with CAD, 3D visualization, and rendering</li><li>Expertise in one or more programming languages: C#, C/C++, JavaScript, Python</li><li>Experience with frameworks and technologies such as .NET, WPF/XAML, DirectX, OpenGL, WebGL</li><li>Proficient in tools like Visual Studio and Git</li><li>Knowledge of common architectural design patterns like MVC, MVVM, Dependency Injection, etc.<br><br></li></ul><strong>Shape your career with 3DS! #WeAre3DS<br><br></strong><strong>Diversity statement<br><br></strong>As a game-changer in sustainable technology and innovation, Dassault Systèmes is striving to build more inclusive and diverse teams across the globe. We believe that our people are our number one asset and we want all employees to feel empowered to bring their whole selves to work every day. It is our goal that our people feel a sense of pride and a passion for belonging. As a company leading change, it’s our responsibility to foster opportunities for all people to participate in a harmonized Workforce of the Future.<br><br><strong>Compensation &amp; Benefits<br><br></strong>Dassault Systèmes offers an excellent salary with potential for bonus, commensurate with experience. Benefits include a choice of plans providing comprehensive coverage for medical, dental, vision care for employee &amp; dependents as well as employee life, short &amp; long term disability, tuition reimbursement, immediate 401K enrollment, 401K match (50 cents on the dollar, up to the first 8% of your eligible compensation that you contribute based on match eligibility criteria), flexible time off policy, and 10 paid holidays.<br><br>Equal opportunity<br><br>In order to provide equal employment and advancement opportunities to all individuals, employment decisions at 3DS are based on merit, qualifications and abilities. 3DS is committed to a policy of non-discrimination and equal opportunity for all employees and qualified applicants without regard to race, color, religion, gender, sex (including pregnancy, childbirth or medical or common conditions related to pregnancy or childbirth), sexual orientation, gender identity, gender expression, marital status, familial status, national origin, ancestry, age (40 and above), disability, veteran status, military service, application for military service, genetic information, receipt of free medical care, or any other characteristic protected under applicable law. 3DS will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable law.\n        </div>"], "company_link": "https://fr.linkedin.com/company/dassaultsystemes?trk=public_jobs_topcard-org-name", "seniority_level": "entry level", "employment_type": "full-time", "job_function": "engineering and information technology", "industries": "it services and it consulting, software development, and research services"}